------------------------------------------------------------------------------------------
-- ChangeLog ver 1.0
-- 日期: 2010-4-3
-- 作者: dugu
-- 描述: 多玩魔盒更新日志信息(简体中文)
-- 版权所有 (c) duowan.com
------------------------------------------------------------------------------------------
DUOWAN_CHANGELOG = "";

local function HTML_BEGIN()
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG ..  "<HTML><BODY>";
end

local function HTML_TITLE(txt)
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG ..  "<H1>" .. txt .. "</H1>";
end

local function HTML_VER(ver)
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG ..  "<H2>" .. ver .. "</H2>";
end

local function HTML_SPACE()
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG .. "<BR/>";
end

local function HTML_LOG(head, desc)
	--local head = head or "";
	local desc = desc or "";
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG ..  "<P>|cff00e0e0" .. head .. ": |R" .. desc .. "</P>";
end

local function HTML_END()
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG ..  "</BODY></HTML>";
end

if (GetLocale() == "zhCN") then
	HTML_BEGIN();
		HTML_TITLE("更新日志:");
		HTML_VER("2016-04-05(6.0.7.6)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("要塞模块", "要塞增强包更新");	
		HTML_LOG("泰坦信息条", "更新新版");
		HTML_LOG("战斗指示", "战斗时间模块更新");
		HTML_LOG("多玩界面", "内置库更新");
		
		HTML_VER("2016-03-29(6.0.7.5)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("首领模块", "艾斯卡助手更新");
		HTML_LOG("要塞模块", "要塞增强包更新");	
		HTML_LOG("多玩界面", "邮件助手更新");
		HTML_LOG("伤害统计", "更新Skada到最新版本");
		
		HTML_VER("2016-03-24(6.0.7.4)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("团队助手", "oRA3更新新版");
		HTML_LOG("多玩界面", "针对6.2.4更新");
		HTML_LOG("多玩界面", "邮件助手更新");

		HTML_VER("2016-03-22(6.0.7.3)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("团队助手", "oRA3更新新版");
		HTML_LOG("首领模块", "艾斯卡助手更新");
		
		HTML_VER("2016-03-15(6.0.7.2)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("要塞模块", "要塞增强包更新");	
		HTML_LOG("竞技大师", "竞技场大师更新新版");
		HTML_LOG("泰坦信息条", "更新新版");
		HTML_LOG("伤害统计", "更新Recount到最新版本");
		HTML_LOG("伤害统计", "更新Skada到最新版本");
		HTML_LOG("地图增强", "大地图增强更新");

		HTML_VER("2016-03-08(6.0.7.1)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("首领模块", "使用/dbm pull时会对传奇戒指和职责进行匹配检查");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		HTML_LOG("采集助手", "采集助手数更新");
		HTML_LOG("要塞模块", "要塞增强包更新");	
		HTML_LOG("多玩界面", "一些内置库更新");
		
		HTML_VER("2016-03-01(6.0.7.0)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("任务指示", "任务指示数据库更新");
		HTML_LOG("竞技大师", "竞技场大师更新新版");

		HTML_VER("2016-02-24(6.0.6.9)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("泰坦信息条", "更新新版");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("考古助手", "更新考古助手");
		
		HTML_VER("2016-02-16(6.0.6.8)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("团队助手", "集合石插件更新");
		HTML_LOG("宠物助手", "更新HPetBattleAny新版");
		HTML_LOG("采集助手", "采集助手数更新");
		HTML_LOG("伤害统计", "更新Recount到最新版本");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		HTML_LOG("竞技大师", "竞技场大师更新新版");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("泰坦信息条", "更新新版");

		HTML_VER("2016-02-02(6.0.6.7)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("任务指示", "任务指示数据库更新");
		HTML_LOG("泰坦信息条", "更新新版");
		HTML_LOG("地图增强", "大地图增强更新");

		HTML_VER("2016-01-26(6.0.6.6)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("副本掉落", "更新V8.00.72");
		HTML_LOG("团队助手", "集合石插件更新");
		HTML_LOG("首领模块", "艾斯卡助手更新");
		
		HTML_VER("2016-01-19(6.0.6.5)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("副本掉落", "更新V8.00.71");
		HTML_LOG("团队助手", "oRA3更新新版");
		HTML_LOG("团队助手", "集合石插件更新");	
		HTML_LOG("多玩界面", "一些内置库更新");
		
		HTML_VER("2016-01-12(6.0.6.4)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("副本掉落", "更新V8.00.70");
		HTML_LOG("泰坦信息条", "更新新版");
		HTML_LOG("多玩界面", "一些内置库更新");
		
		HTML_VER("2016-01-06(6.0.6.3)");
		HTML_LOG("团队助手", "集合石插件更新");		
		HTML_LOG("采集助手", "采集助手数更新");
		HTML_LOG("伤害统计", "更新Recount到最新版本");
		HTML_LOG("多玩界面", "地图标记模块更新");
		HTML_LOG("鼠标提示", "修正查看装等时偶尔的报错");
		
		HTML_VER("2015-12-29(6.0.6.2)");
		HTML_LOG("团队助手", "集合石插件更新");
		HTML_LOG("竞技大师", "竞技场大师更新新版");
		HTML_LOG("鼠标提示", "修正装等和物品等级显示");
	
		HTML_TITLE("更新日志:");
		HTML_VER("2015-12-22(6.0.6.1)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("装备信息", "增加装备属性统计插件");
		HTML_LOG("坐骑来源", "更改坐骑来源数据和显示方式");
		
		HTML_VER("2015-12-15(6.0.6.0)");
		HTML_LOG("首领模块", "更新DBM语音版和语音包");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		HTML_LOG("姓名版增强", "默认禁用仇恨眼晴");
		HTML_LOG("传送门条", "增加战争之矛");
		HTML_LOG("伤害统计", "更新Recount到最新版本");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("团队助手", "集合石插件更新");
		
		HTML_VER("2015-12-08(6.0.5.9)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("姓名版增强", "更新仇恨眼晴开关问题");
		HTML_LOG("任务指示", "任务指示数据库更新");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		HTML_LOG("泰坦信息条", "增加勇气点数显示并可追踪获取来源");
		HTML_LOG("团队助手", "集合石插件更新");
		
		HTML_VER("2015-12-01(6.0.5.8)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("考古助手", "更新考古助手");
		HTML_LOG("采集助手", "采集助手数据库更新");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		HTML_LOG("姓名版增强", "增加姓名版增强显示玩家的BUFF/DEBUFF");
		
		HTML_VER("2015-11-24(6.0.5.7)");
		HTML_LOG("首领模块", "更新DBM语音版和旧副本模块");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("团队助手", "集合石插件更新");
		HTML_LOG("竞技大师", "竞技场大师更新新版");
		HTML_LOG("伤害统计", "更新Recount到最新版本");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		HTML_LOG("首领模块", "艾斯卡助手更新");
		HTML_LOG("副本掉落", "更新V8.00.60");
		HTML_LOG("鼠标提示", "修正装等和物品等级显示");
		HTML_LOG("技能特效报警", "只为玩家施放的法术不能选中的问题");

		HTML_VER("2015-11-17(6.0.5.6)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		HTML_LOG("团队助手", "集合石插件更新");

		HTML_VER("2015-11-10(6.0.5.5)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("副本掉落", "更新V8.00.52");
		HTML_LOG("伤害统计", "更新Recount到最新版本");
		HTML_LOG("泰坦信息条", "泰坦信息条更新");
		HTML_LOG("竞技大师", "竞技场大师更新新版");
		
		HTML_VER("2015-11-03(6.0.5.4)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("采集助手", "采集助手数据库更新");
		HTML_LOG("首领模块", "艾斯卡助手更新");
		HTML_LOG("线性冷却", "修正线性冷却条不显示的问题");
		
		HTML_VER("2015-10-27(6.0.5.3)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("伤害统计", "更新Recount到最新版本");
		HTML_LOG("采集助手", "采集助手数据库更新");
		HTML_LOG("多玩界面", "ACE3等内置库更新");
		
		HTML_VER("2015-10-20(6.0.5.2)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("线性冷却", "修正有些技能冷却显示不正确的问题");
		HTML_LOG("考古助手", "更新考古助手");
		HTML_LOG("采集助手", "采集助手数据库更新");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		
		HTML_VER("2015-10-15(6.0.5.1)");
		HTML_LOG("首领模块", "更新DBM语音版并修正问题");
		
		HTML_VER("2015-10-13(6.0.5.0)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("要塞模块", "更新WOD宝藏模块");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("便捷工具", "魔兽达人插件更新");
		HTML_LOG("地图增强", "小地图增强SexyMap更新新版");
		HTML_LOG("任务指示", "任务指示数据库更新");
		HTML_LOG("竞技大师", "竞技场大师更新新版");
		
		HTML_VER("2015-10-08(6.0.4.9)");
		HTML_LOG("首领模块", "更新DBM语音版及旧副本模块");
		HTML_LOG("副本掉落", "更新V8.00.51");
		HTML_LOG("伤害统计", "更新Recount到最新版本");
		HTML_LOG("要塞模块", "更新WOD宝藏模块");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		
		HTML_VER("2015-09-29(6.0.4.8)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("考古助手", "更新考古助手");
		HTML_LOG("地图增强", "大地图增强更新");
		HTML_LOG("团队助手", "oRA3更新新版");
		HTML_LOG("首领模块", "艾斯卡助手更新");
		HTML_LOG("任务指示", "任务指示数据库更新");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("竞技大师", "竞技场大师更新新版");
		HTML_LOG("多玩界面", "地图标记模块更新");
		
		HTML_VER("2015-09-22(6.0.4.7)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("副本掉落", "更新V8.00.50");
		HTML_LOG("任务增强", "TomTom导航助手更新");
		HTML_LOG("多玩界面", "地图标记模块更新");
		HTML_LOG("团队助手", "oRA3更新新版");
		HTML_LOG("多玩界面", "更新一些内置库文件");
		
		HTML_VER("2015-09-15(6.0.4.6)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		HTML_LOG("首领模块", "艾斯卡助手更新");
		HTML_LOG("团队助手", "oRA3更新新版");
		HTML_LOG("采集助手", "采集助手更新");
		HTML_LOG("要塞资讯", "更新新版");
		HTML_LOG("任务指示", "任务指示数据库更新");
		
		HTML_VER("2015-09-08(6.0.4.5)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("要塞资讯", "更新新版");
		HTML_LOG("伤害统计", "更新Recount到最新版本");
		HTML_LOG("采集助手", "采集助手更新");
		HTML_LOG("考古助手", "更新考古助手到最新版本");
		
		HTML_VER("2015-09-01(6.0.4.4)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("法术计时器", "修正被错误禁用的图腾框");
		HTML_LOG("多玩界面", "修正有些设置不能保存的问题");
		HTML_LOG("多玩界面", "更新一些内置库文件");
		
		HTML_VER("2015-08-24(6.0.4.3)");
		HTML_LOG("首领模块", "更新DBM语音版和旧世界模块");
		HTML_LOG("考古助手", "更新考古助手到最新版本");
		HTML_LOG("首领模块", "艾斯卡助手更新");
		HTML_LOG("团队框架", "Grid增补一些副本DEBUFF");
		HTML_LOG("团队助手", "oRA3更新新版");
		HTML_LOG("伤害统计", "更新Recount到最新版本");
		HTML_LOG("多玩界面", "地图标记模块更新");
		
		HTML_VER("2015-08-18(6.0.4.2)");
		HTML_LOG("首领模块", "更新DBM语音版和旧世界模块");
		HTML_LOG("多玩界面", "修正战斗中成员变动团框有时不可点选的问题");
		HTML_LOG("考古助手", "更新考古助手到最新版本");
		HTML_LOG("采集助手", "采集助手数据库更新");
		HTML_LOG("团队助手", "oRA3更新新版");
		
		HTML_VER("2015-08-11(6.0.4.1)");
		HTML_LOG("首领模块", "更新DBM语音版和旧世界模块");
		HTML_LOG("团队助手", "oRA3更新新版");
		HTML_LOG("多玩界面", "修正系统菜单中部份按钮失效的问题");
		HTML_LOG("采集助手", "采集助手数据库更新");
		HTML_LOG("法术助手", "法术学习助手模块更新");
		HTML_LOG("任务指示", "任务指示数据库更新");
		HTML_LOG("多玩界面", "可ROLL装备列表修正有时物品不显示");
		
		HTML_VER("2015-08-04(6.0.4.0)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("团队助手", "oRA3更新新版");
		HTML_LOG("团队框架", "Grid增补一些副本DEBUFF");
		HTML_LOG("爱心功能", "增加就绪准备检查时任务栏闪烁");
		
		HTML_VER("2015-07-29(6.0.3.9)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("距离显示", "距离显示模块更新");
		HTML_LOG("金团助手", "地图增加地狱火堡垒");
		HTML_LOG("首领模块", "艾斯卡助手更新");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		HTML_LOG("采集助手", "采集助手更新");
		HTML_LOG("伤害统计", "更新Recount到最新版本");
		HTML_LOG("泰坦信息条", "泰坦信息条更新");
		HTML_LOG("便捷工具", "魔兽达人插件更新");
		
		HTML_VER("2015-07-21(6.0.3.8)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		HTML_LOG("首领模块", "艾斯卡助手更新");
		HTML_LOG("职业辅助", "增加武僧魂体双分和术士法阵距离监视模块");
		HTML_LOG("团队助手", "oRA3更新新版");
		HTML_LOG("便捷工具", "魔兽达人插件更新");
		HTML_LOG("副本掉落", "更新V8.00.40");
		HTML_LOG("团队助手", "集合石插件更新");
		
		HTML_VER("2015-07-14(6.0.3.7)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("团队框架", "Grid增补一些副本DEBUFF");
		HTML_LOG("团队助手", "oRA3更新新版");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		HTML_LOG("距离显示", "距离显示模块更新");
		HTML_LOG("任务指示", "任务指示数据库更新");
		
		HTML_VER("2015-07-07(6.0.3.6)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("地图增强", "增加飞行世界地图功能.");
		HTML_LOG("团队框架", "Grid增补一些副本DEBUFF");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("伤害统计", "更新Skada到最新版本");
		HTML_LOG("伤害统计", "更新Recount到最新版本");
		HTML_LOG("首领模块", "艾斯卡助手更新,增加中键选择玩家功能");
		HTML_LOG("要塞模块", "要塞资讯模块更新");
		
		HTML_VER("2015-06-30(6.0.3.5)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("宠物助手", "更新HPetBattleAny新版");
		HTML_LOG("伤害统计", "更新Skada到最新版本");
		HTML_LOG("伤害统计", "更新Recount到最新版本");
		HTML_LOG("团队助手", "oRA3更新新版");
		HTML_LOG("采集助手", "采集助手更新");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("泰坦信息条", "增强要塞物资和原油显示字段");
		HTML_LOG("泰坦信息条", "移除直接购买时光徽章的功能");
		HTML_LOG("任务增强", "任务增强模块更新");
		HTML_LOG("首领模块", "增加艾斯卡助手");

		HTML_VER("2015-06-25(6.0.3.4)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("团队助手", "ORA3更新新版");
		HTML_LOG("竞技大师", "Gladius更新新版");
		HTML_LOG("伤害统计", "Recount更新新版");
		HTML_LOG("副本掉落", "更新V8.00.30");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("要塞模块", "更新WOD宝藏模块");
		HTML_LOG("团队框架", "Grid副本DEBUFF更新");
		HTML_LOG("团队助手", "集合石插件更新");
		
		HTML_VER("2015-06-24(6.0.3.3)");
		HTML_LOG("多玩魔盒", "全面更新到6.2版本");
		
		HTML_VER("2015-06-16(6.0.3.2)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("便捷工具", "增加魔兽达人坐骑增强插件");
		HTML_LOG("伤害统计", "Recount更新新版");
		
		HTML_VER("2015-06-09(6.0.3.1)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("要塞模块", "修正任务控制台中追随者鼠标提示不显示的问题");
		HTML_LOG("背包整合", "背包中添加材料标签以显示专业背包的内容");
		HTML_LOG("地图增强", "副本难度按钮改为一直显示,用户可在小地图右键菜单中个性化定制");
		HTML_LOG("商业技能库", "更新新版并汉化修复错误");
		HTML_LOG("竞技大师", "竞技场大师更新新版");
		
		HTML_VER("2015-06-02(6.0.3.0)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("泰坦信息条", "更新新版");
		HTML_LOG("考古助手", "更新考古助手到最新版本");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		HTML_LOG("伤害统计", "Recount更新新版");
		HTML_LOG("地图增强", "小地图增强SexyMap更新新版");
		
		HTML_VER("2015-05-26(6.0.2.9)");
		HTML_LOG("首领模块", "更新DBM语音版及WLK模块,添加6.2的地狱火堡垒模块");
		HTML_LOG("头像增强", "修正在团队时显示小队头像开关无效的问题");
		HTML_LOG("要塞模块", "禁用要塞点唱机歌曲位置模块,会影响降帧");
		HTML_LOG("副本掉落", "更新V8.00.00");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("多玩界面", "更新一些内置库文件");
		
		HTML_VER("2015-05-18(6.0.2.8)");
		HTML_LOG("首领模块", "更新DBM语音版及旧副本模块");
		HTML_LOG("团队助手", "集合石插件更新");
		HTML_LOG("竞技大师", "竞技场大师更新新版");
		HTML_LOG("要塞模块", "添加要塞点唱机歌曲位置模块");
		HTML_LOG("多玩界面", "可ROLL装备列表更新");
		HTML_LOG("要塞模块", "要塞资讯模块更新");
		HTML_LOG("副本掉落", "更新V8.00.00beta8_1");
		
		HTML_VER("2015-05-13(6.0.2.7)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("采集助手", "采集助手数据库更新");
		HTML_LOG("泰坦信息条", "更新新版添加专业技能字段");
		
		HTML_VER("2015-05-05(6.0.2.6)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("团队助手", "ORA3更新新版");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		HTML_LOG("考古助手", "更新考古助手到最新版本");
		HTML_LOG("竞技大师", "竞技场大师更新新版");
		HTML_LOG("要塞模块", "更新WOD宝藏模块");
		HTML_LOG("要塞模块", "大地图右上角增加按钮可以快捷开关地图标记");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("泰坦信息条", "在金币字段增加显示魔兽世界时光徽章价格,可并直接购买.");
		
		HTML_VER("2015-04-28(6.0.2.5)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("伤害统计", "Recount更新新版");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("便捷工具", "右键菜单增强更新");
		HTML_LOG("法术助手", "法术学习助手模块更新");
		
		HTML_VER("2015-04-21(6.0.2.4)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		HTML_LOG("泰坦信息条", "更新新版");
		HTML_LOG("便捷工具", "增加俯仰角显示");
		
		HTML_VER("2015-04-13(6.0.2.3)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("考古助手", "更新考古助手到最新版本");
		HTML_LOG("竞技大师", "竞技场大师更新新版");
		HTML_LOG("多玩聊天", "修改转发频道和世界频道开关为左右键分开");
		HTML_LOG("要塞模块", "要塞增强包更新");
		
		HTML_VER("2015-04-07(6.0.2.2)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("考古助手", "更新考古助手到最新版本");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		HTML_LOG("一键驱散", "一键驱散更新新版");	
		HTML_LOG("宠物助手", "更新HPetBattleAny新版");
		HTML_LOG("伤害统计", "Recount v6.1.2a");
		HTML_LOG("可接任务查询", "更新大量任务数据");
		HTML_LOG("团队助手", "集合石插件更新");
		HTML_LOG("团队助手", "在系统帮助里添加延迟反馈功能");
		
		HTML_VER("2015-03-31(6.0.2.1)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("伤害统计", "Recount v6.1.0b");
		HTML_LOG("伤害统计", "Skada增加闪招、治疗石和青龙之赐模块");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("要塞模块", "要塞资讯模块更新");		
		HTML_LOG("团队助手", "集合石插件更新");	
		HTML_LOG("任务指示", "任务指示数据库更新");
		HTML_LOG("战斗指示", "添加战斗时间显示模块");
		HTML_LOG("背包整合", "移除背包中无用的材料过滤标签");
		
		HTML_VER("2015-03-24(6.0.2.0)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("伤害统计", "更新Skada到最新版本");
		HTML_LOG("金团助手", "报告窗口增加副本频道");
		HTML_LOG("索戈尔助手", "更新新版补充随机难度数据");
		HTML_LOG("任务指示数据库", "更新新版");
		HTML_LOG("考古助手", "更新考古助手到最新版本");
		HTML_LOG("竞技大师", "竞技场语音更新新版");
		HTML_LOG("多玩魔盒", "其它一些库更新和小BUG修正");
		
		HTML_VER("2015-03-17(6.0.1.9)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("伤害统计", "更新Skada到最新版本");
		HTML_LOG("考古助手", "更新考古助手到最新版本");
		HTML_LOG("要塞模块", "要塞增强包更新");
		HTML_LOG("团队助手", "集合石插件更新");	
		HTML_LOG("泰坦信息条", "更新新版");
		HTML_LOG("任务指示", "任务指示数据库更新");
		
		HTML_VER("2015-03-10(6.0.1.8)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("伤害统计", "更新伤害统计到最新版本");
		HTML_LOG("考古助手", "更新考古助手到最新版本");
		HTML_LOG("收支统计", "更新到最新版本");	
		HTML_LOG("要塞模块", "要塞资讯模块更新");
		HTML_LOG("爱心功能", "增加屏幕定位点,默认关闭战斗时显示");
		
		HTML_VER("2015-03-03(6.0.1.7)");
		HTML_LOG("首领模块", "更新DBM语音版");
		HTML_LOG("多玩界面", "修复萨满职业界面变形错误");
		HTML_LOG("宠物助手", "集成HPetBattleAny并修复其错误");
		HTML_LOG("副本掉落", "更新V8.00.00beta8");
		HTML_LOG("多玩界面", "可ROLL装备列表更新");
		HTML_LOG("多玩界面", "邮件助手更新");
		
		HTML_VER("2015-02-26(6.0.1.6)");
		HTML_LOG("首领模块", "更新DBM语音版,适配6.1");
		HTML_LOG("伤害统计", "更新伤害统计到最新版本");
		HTML_LOG("考古助手", "更新考古助手到最新版本");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");
		HTML_LOG("要塞模块", "要塞资讯模块更新");
		HTML_LOG("仇恨统计", "仇恨统计升级到最新版本");
		HTML_LOG("首领模块", "奥尔高格助手插件更换,全团只需3人以上安装即可");
		HTML_LOG("首领模块", "索戈尔助手更新");
		HTML_LOG("采集助手", "采集助手和数据库更新");
		HTML_LOG("泰坦信息条", "更新新版");
		HTML_LOG("一键驱散", "一键驱散更新新版");	
		HTML_LOG("团队助手", "集合石插件更新");		
		HTML_LOG("多玩魔盒", "其它一些针对6.1的修改");
		
		HTML_VER("2015-02-11(6.0.1.5)");
		HTML_LOG("首领模块", "更新DBM语音版,更新黑石铸造厂等");	
		HTML_LOG("首领模块", "添加奥尔高格助手,索戈尔助手");
		HTML_LOG("团队助手", "集合石插件更新");
		HTML_LOG("要塞模块", "要塞资讯模块更新");
		HTML_LOG("团队框架", "更新黑石RaidDebuff");
		HTML_LOG("金团助手", "更新金团助手");
		
		HTML_VER("2015-02-04(6.0.1.4)");
		HTML_LOG("首领模块", "更新DBM语音版,更新黑石铸造厂等");		
		HTML_LOG("团队框架", "更新黑石铸造厂副本DEBUFF");
		HTML_LOG("多玩魔盒", "更新考古,竞技场语音等插件");
		HTML_LOG("任务提示", "可接任务数据库更新");
		HTML_LOG("属性报告", "加入溅射全能等属性");
		HTML_LOG("物品信息", "装备比较关闭时将禁用系统自带的比较");
		HTML_LOG("伤害统计", "Recount更新");
		HTML_LOG("团队助手", "添加索加尔助手,更新一些技能冷却");
		HTML_LOG("稀有精英探测", "汉化追踪框的NPC名字");
		HTML_LOG("要塞模块", "添加隐藏保镖对话框的功能,默认关闭");
		
		HTML_VER("2015-01-27(6.0.1.3)");
		HTML_LOG("伤害统计", "Recount更新");
		HTML_LOG("竞技大师", "竞技场技能语音更新夏一可版");
		HTML_LOG("首领模块", "更新6.0.14新内核,DBM配置重置");
		HTML_LOG("团队助手", "集合石插件更新");
		HTML_LOG("要塞模块", "要塞增强包更新新版,添加查看招募追随者技能信息功能");
		HTML_LOG("稀有精英探测", "更新新版");
		HTML_LOG("技能冷却", "更新线性冷却计时条");
		HTML_LOG("团队框架", "更新悬槌堡副本DEBUFF");
		HTML_LOG("竞技大师", "竞技场技能语音更新到夏一可版");
		HTML_LOG("鼠标提示", "加入技能物品等ID显示");
		HTML_LOG("战斗指示", "修正DCT一些错误");
		HTML_LOG("泰坦信息条", "更新新版并修正经验等模块的错误");
		HTML_LOG("多玩界面", "成就界面增加搜索框");
		HTML_LOG("多玩界面", "一些设置选项添加和修正");
		
		HTML_VER("2015-01-20(6.0.1.2)");
		HTML_LOG("首领模块", "修复DBM不完整的问题");

		HTML_VER("2015-01-17(6.0.1.1)");
		HTML_LOG("伤害统计", "更新到最新版本");
		
		HTML_VER("2015-01-12(6.0.1.0)");
		HTML_LOG("要塞模块", "要塞增强包更新新版,添加分配追随者到建筑物功能");
		HTML_LOG("要塞模块", "要塞资讯模块更新");
		HTML_LOG("团队助手", "更新团队助手到最新版本");
		HTML_LOG("副本掉落", "更新V8.00.00beta7");
		HTML_LOG("采集助手", "采集助手和数据库更新");
		HTML_LOG("伤害统计", "Skada更新");
		HTML_LOG("多玩界面", "可ROLL装备列表更新");
		HTML_LOG("首领模块", "更新至最新的12387语音版");
		
		HTML_VER("2015-01-03(6.0.0.9)");
		HTML_LOG("伤害统计", "Skada,Recount更新最新版");
		HTML_LOG("要塞模块", "要塞增强包更新新版");
		HTML_LOG("要塞模块", "要塞资讯模块更新");
		HTML_LOG("采集助手", "采集助手和数据库更新");
		HTML_LOG("首领模块", "更新至最新的12286语音版");
		HTML_LOG("副本掉落", "更新V8.00.00beta6");
		HTML_LOG("团队助手", "集合石插件更新");
		
		HTML_VER("2014-12-23(6.0.0.8)");
		HTML_LOG("伤害统计", "Skada更新并增加队友误伤模块");
		HTML_LOG("特效指示器", "EventAlertMods修正补充全职业预设技能");
		HTML_LOG("首领模块", "更新到12134正式版");
		HTML_LOG("要塞模块", "要塞资讯模块更新");
		HTML_LOG("副本掉落", "更新V8.00.00beta5");
		HTML_LOG("任务提示", "可接任务数据库更新");
		
		HTML_VER("2014-12-18(6.0.0.7)");
		HTML_LOG("伤害统计", "Skada,Recount更新");
		HTML_LOG("首领模块", "更新到夏一可语音版本,移除旧副本模块");
		HTML_LOG("要塞模块", "GarrisonMissionManager V13");
		HTML_LOG("要塞模块", "要塞资讯更新 1.3.3");
		HTML_LOG("要塞模块", "订单窗口增加队伍最大数量按钮");
		HTML_LOG("团队框架", "GridStatusRD_Wod 1.7");
		HTML_LOG("采集助手", "数据库更新至v24.4");
		HTML_LOG("头像增强", "修正3D头像显示");
		HTML_LOG("多玩界面", "修正姿态条默认值错误");
		HTML_LOG("多玩界面", "重置精简模式开关");
		HTML_LOG("技能冷却", "线性冷却计时条更新");
		HTML_LOG("动作条", "职业守护条更新");
		HTML_LOG("物品咨询", "商业技能库更新");
		
		HTML_VER("2014-12-04(6.0.0.6)");
		HTML_LOG("任务增强", "修复TomTom开关");
		HTML_LOG("首领模块", "更新到夏一可语音版本");
		HTML_LOG("采集助手", "更新到1.33");
		HTML_LOG("伤害统计", "Skada更新到r589");
		HTML_LOG("团队框架", "添加WOD副本DEBUFF");
		HTML_LOG("团队框架", "增加30人布局");
		HTML_LOG("拍卖助手", "重新添加离线黑市");
		HTML_LOG("多玩魔盒", "修复按钮保存功能");
		HTML_LOG("任务增强", "新的任务增强模块");
		HTML_LOG("多玩魔盒", "变形界面启用姿态条");
		HTML_LOG("竞技大师", "竞技场技能语音更新");
		HTML_LOG("多玩魔盒", "一些BUG修正");
		
		HTML_VER("2014-12-04(6.0.0.5)");
		HTML_LOG("要塞模块", "增加德拉诺宝箱模块");
		HTML_LOG("要塞模块", "增加要塞追随者插件");
		HTML_LOG("要塞模块", "增加要塞资讯插件");
		HTML_LOG("多玩魔盒", "修正NPC位置显示等BUG");
		HTML_LOG("多玩魔盒", "更新考古,竞技场等插件");
		HTML_LOG("多玩魔盒", "添加集合石插件");
		HTML_LOG("首领模块", "更新到夏一可语音版本");
		HTML_LOG("任务增强", "增加TomTom导航助手");

		HTML_VER("2014-11-22(6.0.0.4)");
		HTML_LOG("首领模块", "更新首领模块到夏一可版本");

		HTML_VER("2014-11-20(6.0.0.3)");
		HTML_LOG("多玩魔盒", "修正一大波BUG");
		HTML_LOG("任务提示", "增加可接任务提示(大地图左上角)");

		HTML_VER("2014-10-23(6.0.0.2)");
		HTML_LOG("背包整合", "修正背包不能查看材料的错误");

		HTML_VER("2014-10-21(6.0.0.1)");
		HTML_LOG("背包整合", "增加材料银行的查看");
		HTML_LOG("首领模块", "更新到语音版本");

		HTML_VER("2014-10-16(6.0.0.0)");
		HTML_LOG("多玩魔盒", "全面更新到6.0前夕版本");

		HTML_VER("2014-08-21(5.4.0.20)");
		HTML_LOG("免费电话", "增加微会免费电话福利");

		HTML_VER("2014-07-22(5.4.0.19)");
		HTML_LOG("新兵助手", "修正开关状态不同步问题");
		HTML_LOG("战斗指示器", "修正无法完全关闭提示的问题");

		HTML_VER("2014-07-03(5.4.0.18)");
		HTML_LOG("装备等级", "修正装备等级显示错误");
		HTML_LOG("新兵助手", "增加开启确认项");

		HTML_VER("2014-07-02(5.4.0.17)");
		HTML_LOG("团队报警器", "更新团队报警器");
		HTML_LOG("新兵助手", "更新新兵助手");
		HTML_LOG("按键配置", "更新按键配置到新版本");

		HTML_VER("2014-02-18(5.4.0.16)");
		HTML_LOG("团队框架", "增加决战奥格瑞玛的减益提示");

		HTML_VER("2014-01-19(5.4.0.15)");
		HTML_LOG("多玩魔盒", "修正团队框架不显示debuff的问题");

		HTML_VER("2014-01-11(5.4.0.14)");
		HTML_LOG("多玩魔盒", "更新团队框架");

		HTML_VER("2014-01-08(5.4.0.13)");
		HTML_LOG("多玩魔盒", "修正不能更换天赋问题");

		HTML_VER("2014-01-07(5.4.0.12)");
		HTML_LOG("多玩魔盒", "尝试修正不能更换天赋问题");

		HTML_VER("2013-12-11(5.4.0.11)");
		HTML_LOG("一键重铸", "更正一键重铸数据错误");

		HTML_VER("2013-12-09(5.4.0.10)");
		HTML_LOG("一键重铸", "修正一键重铸无法使用的问题");
		HTML_LOG("稀有精英探测", "修正缺省不显示名字的问题");

		HTML_VER("2013-12-08(5.4.0.9)");
		HTML_LOG("副本掉落", "更新副本掉落到最新版本");
		HTML_LOG("首领模块", "更新首领模块到最新版本");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");

		HTML_VER("2013-10-31(5.4.0.8)");
		HTML_LOG("任务指引", "修正任务指引箭头不显示的错误");

		HTML_VER("2013-10-30(5.4.0.7)");
		HTML_LOG("首领模块", "更新首领模块到最新版本");
		HTML_LOG("首领击杀", "增加团队查找神器(随机和弹性)");

		HTML_VER("2013-10-11(5.4.0.6)");
		HTML_LOG("拍卖助手", "修正一处引起报错的问题");

		HTML_VER("2013-10-10(5.4.0.5)");
		HTML_LOG("首领模块", "增加旧世界的首领模块");

		HTML_VER("2013-09-18(5.4.0.4)");
		HTML_LOG("魔兽世界", "修正5.4后变卡的问题");

		HTML_VER("2013-09-18(5.4.0.3)");
		HTML_LOG("多玩魔盒", "修正一处报错的问题");

		HTML_VER("2013-09-15(5.4.0.2)");
		HTML_LOG("背包整合", "修正背包内物品高亮显示错误");
		HTML_LOG("头像增强", "去掉目标的目标上多余黄字");	

		HTML_VER("2013-09-12(5.4.0.1)");
		HTML_LOG("新兵助手", "增加官方新兵助手插件");	

		HTML_VER("2013-09-12(5.4.0.0)");
		HTML_LOG("多玩魔盒", "全面支持5.4版本");	

		HTML_VER("2013-07-09(5.3.0.3)");
		HTML_LOG("首领模块", "更新首领模块到最新版本");	

		HTML_VER("2013-05-25(5.3.0.2)");
		HTML_LOG("竞技语音", "竞技语音现在可以正常使用了");	
		HTML_LOG("任务指示", "任务指示箭头会正常显示了");	

		HTML_VER("2013-05-23(5.3.0.1)");
		HTML_LOG("多玩聊天", "增加副本频道的快捷方式");	
		HTML_LOG("地图增强", "更新为兼容5.3模式版本");
		HTML_LOG("首领模块", "更新为兼容5.3模式版本");

		HTML_VER("2013-05-23(5.3.0.0)");
		HTML_LOG("多玩魔盒", "更新到5.3兼容版本");		

		HTML_VER("2013-04-15(5.2.0.8)");
		HTML_LOG("团队框架", "提示信息将固定在右下角");
		HTML_LOG("地图增强", "去掉大地图上多余的光圈");

		HTML_VER("2013-04-13(5.2.0.7)");
		HTML_LOG("官方频道", "增加暴雪官方频道公告");

		HTML_VER("2013-04-10(5.2.0.6)");
		HTML_LOG("副本掉落", "更新副本掉落到最新版本");
		HTML_LOG("地图增强", "增加雷电王座地图查看");		

		HTML_VER("2013-04-08(5.2.0.5)");
		HTML_LOG("团队框架", "更新团队框架到最新版本");
		HTML_LOG("一键重铸", "更新一键重铸到最新版本");
		HTML_LOG("首领报警", "修正首领报警没有语音的错误");

		HTML_VER("2013-04-08(5.2.0.4)");
		HTML_LOG("伤害统计", "更新伤害统计到最新版本");
		HTML_LOG("考古助手", "更新考古助手到最新版本");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版本");

		HTML_VER("2013-04-07(5.2.0.3)");
		HTML_LOG("地图增强", "修正地图增强配置不能保存的问题");
		HTML_LOG("金团助手", "金团助手现在可以正常使用了");
		HTML_LOG("首领模块", "首领模块更新到最新版本");

		HTML_VER("2013-03-14(5.2.0.2)");
		HTML_LOG("地图增强", "修正地图不能缩放的问题");

		HTML_VER("2013-03-11(5.2.0.1)");
		HTML_LOG("地图增强", "修正地图增强标记错位问题");

		HTML_VER("2013-03-11(5.2.0.0)");
		HTML_LOG("多玩魔盒", "升级到5.0.2版本");

		HTML_VER("2013-02-22(5.1.0.8)");
		HTML_LOG("物品信息", "修正升级后物品等级显示错误");

		HTML_VER("2013-01-05(5.1.0.7)");
		HTML_LOG("地图增强", "修正任务指引引起的地图错乱问题");

		HTML_VER("2012-12-20(5.1.0.6)");
		HTML_LOG("一键重铸", "更新到最新版本");
		HTML_LOG("可接任务查询", "更新大量任务数据");

		HTML_VER("2012-12-14(5.1.0.5)");
		HTML_LOG("首领模块", "增加搏击俱乐部模块");

		HTML_VER("2012-12-12(5.1.0.4)");
		HTML_LOG("离线黑市", "暂时取消引起卡顿的离线黑市模块");

		HTML_VER("2012-12-12(5.1.0.3)");
		HTML_LOG("离线黑市", "尝试修正离线黑市引起的卡顿问题");

		HTML_VER("2012-12-07(5.1.0.2)");
		HTML_LOG("首领模块", "增加惧之煞无脑跑位模块");

		HTML_VER("2012-12-04(5.1.0.1)");
		HTML_LOG("技能触发", "修正技能触发不显示的问题");

		HTML_VER("2012-12-04(5.1.0.0)");
		HTML_LOG("多玩魔盒", "跟随游戏升级到5.1.0.0版本");

		HTML_VER("2012-11-30(5.0.0.25)");
		HTML_LOG("点击施法", "修正点击施法无法使用的错误");

		HTML_VER("2012-11-28(5.0.0.24)");
		HTML_LOG("一键重铸", "修正一键重铸缺省数值不正确问题");

		HTML_VER("2012-11-20(5.0.0.23)");
		HTML_LOG("首领模块", "首领模块更新到最新语音版");
		HTML_LOG("技能触发", "修复DK末日突降等不显示问题");

		HTML_VER("2012-11-14(5.0.0.22)");
		HTML_LOG("多玩魔盒", "修正菜单栏消失和自动组队问题");

		HTML_VER("2012-11-13(5.0.0.21)");
		HTML_LOG("首领模块", "首领模块更新到最新语音版");
		HTML_LOG("离线黑市", "增加离线黑市查看功能");
		HTML_LOG("首领模块", "增加炮舰刷新报警提示");
		HTML_LOG("多玩聊天", "增加恐惧之心一句话攻略");

		HTML_VER("2012-11-05(5.0.0.20)");
		HTML_LOG("基本设置", "将视距调节放到基本设置里面");
		HTML_LOG("一键重铸", "修正一键重铸失效的问题");
		HTML_LOG("多玩魔盒", "尝试修正天赋无法取消的问题");

		HTML_VER("2012-11-01(5.0.0.19)");
		HTML_LOG("拍卖助手", "现在可以正常拍卖战斗宠物了");

		HTML_VER("2012-10-23(5.0.0.18)");
		HTML_LOG("稀有精英探测", "增加MOP的地图数据");
		HTML_LOG("一键重铸", "数据升级到MOP版本");

		HTML_VER("2012-10-19(5.0.0.17)");
		HTML_LOG("任务增强", "修正转发系统公告的错误");
		HTML_LOG("头像增强", "修正队伍成员着色的错误");

		HTML_VER("2012-10-16(5.0.0.16)");
		HTML_LOG("首领模块", "升级到最新版本");
		HTML_LOG("伤害统计", "升级到最新版本");
		HTML_LOG("团队框架", "增加MOP团队BUFF模块");
		HTML_LOG("属性通报", "修正天赋通报错误");

		HTML_VER("2012-10-14(5.0.0.15)");
		HTML_LOG("地图增强", "升级到最新版本");
		HTML_LOG("采集助手", "更新采集助手的数据");
		HTML_LOG("法术计时", "修复AOE类法术的计时");
		HTML_LOG("任务助手", "优化未接任务的逻辑");
		HTML_LOG("宠物对战", "缺省不再开启占用大量资源的排序功能");

		HTML_VER("2012-10-13(5.0.0.14)");
		HTML_LOG("技能触发", "增加武僧猛虎之力和酒醒淡定提示");

		HTML_VER("2012-10-12(5.0.0.13)");
		HTML_LOG("背包整合", "尝试修正背包整合不显示的BUG");

		HTML_VER("2012-10-12(5.0.0.12)");
		HTML_LOG("副本掉落", "增加熊猫人副本掉落数据");
		HTML_LOG("首领模块", "升级到最新语音版本");
		HTML_LOG("竞技助手", "升级到最新版本");
		HTML_LOG("背包整理", "修正因战斗宠物引起的乱序");

		HTML_VER("2012-10-11(5.0.0.11)");
		HTML_LOG("武僧助手", "修正武僧助手的插件版本");
		HTML_LOG("稀有精英探索", "升级到最新版本");

		HTML_VER("2012-10-10(5.0.0.10)");
		HTML_LOG("武僧助手", "增加武僧助手模块");
		HTML_LOG("多玩魔盒", "尝试修正无法取消天赋的错误");

		HTML_VER("2012-10-05(5.0.0.9)");
		HTML_LOG("宠物战斗", "增加宠物对战助手");

		HTML_VER("2012-10-03(5.0.0.8)");
		HTML_LOG("任务增强", "增加自动交接任务功能(缺省关闭)");

		HTML_VER("2012-10-03(5.0.0.7)");
		HTML_LOG("多玩界面", "宠物对战中快捷键可正常使用了");

		HTML_VER("2012-10-02(5.0.0.6)");
		HTML_LOG("多玩魔盒", "修正宠物对战中宠物条不消失的bug");
		HTML_LOG("多玩界面", "请大家暂时不要使用多玩界面");

		HTML_VER("2012-10-02(5.0.0.5)");
		HTML_LOG("多玩魔盒", "修正天赋重载插件按钮与切换天赋的冲突");

		HTML_VER("2012-10-01(5.0.0.4)");
		HTML_LOG("多玩魔盒", "升级到熊猫人正式版本");	

		HTML_VER("2012-09-10(5.0.0.3)");
		HTML_LOG("任务助手", "恢复可接任务插件并显示低等级任务");	

		HTML_VER("2012-09-06(5.0.0.2)");
		HTML_LOG("拍卖助手", "修正无法实时搜索物品价格的错误");	
		HTML_LOG("装备耐久", "修正装备耐久显示为0的错误");
		HTML_LOG("自动修理", "现在可以正确的自动修理了");

		HTML_VER("2012-09-05(5.0.0.1)");
		HTML_LOG("一键驱散", "一键驱散升级到熊猫人版本");	
		HTML_LOG("团队报警器", "修正团队报警器报错的bug");
		HTML_LOG("团队框架", "修正团队框架黑框的问题");
		HTML_LOG("天赋推荐", "增加天赋推荐功能");

		HTML_VER("2012-09-05(5.0.0.0)");
		HTML_LOG("多玩魔盒", "全面升级到熊猫人前夕版本");

		HTML_VER("2012-08-02(4.3.0.38)");
		HTML_LOG("任务增强", "屏蔽可能转发的比赛广告");

		HTML_VER("2012-07-17(4.3.0.37)");
		HTML_LOG("冷却计时", "修正中心冷却可能不显示的BUG");

		HTML_VER("2012-05-10(4.3.0.36)");
		HTML_LOG("职业辅助", "修正5星高亮引起的技能提示错误");

		HTML_VER("2012-05-09(4.3.0.35)");
		HTML_LOG("简易状态", "连击点现在可选择图标形式");
		HTML_LOG("职业辅助", "修正不能关闭5星技能提示的错误");

		HTML_VER("2012-05-07(4.3.0.34)");
		HTML_LOG("简易状态", "连击点数改为数字方式显示");
		HTML_LOG("职业助手", "增加5星技能高亮提示功能");
		HTML_LOG("毒药条", "现在中键可以进行投掷武器上毒");

		HTML_VER("2012-05-01(4.3.0.33)");
		HTML_LOG("多玩魔盒", "修正无法快速设置焦点的错误");

		HTML_VER("2012-05-01(4.3.0.32)");
		HTML_LOG("战斗指示器", "修复不显示低魔法提示错误");
		HTML_LOG("职业辅助", "修正圣能条不保存位置的错误");
		HTML_LOG("好友导入", "修正无法导入好友的错误");
		HTML_LOG("团队框架", "修正无法显示团队职责的错误");
		HTML_LOG("法术计时器", "增加合并过多相同法术选项");

		HTML_VER("2012-04-24(4.3.0.31)");
		HTML_LOG("多玩魔盒", "修正字体变动引起的BUG");

		HTML_VER("2012-04-19(4.3.0.30)");
		HTML_LOG("采集助手", "升级采集助手到最新版本");
		HTML_LOG("随机坐骑", "升级随机坐骑的坐骑数据");
		HTML_LOG("稀有精英", "添加旧世界稀有精英数据");
		HTML_LOG("团队框架", "为团队框架添加角色图标");

		HTML_VER("2012-03-31(4.3.0.29)");
		HTML_LOG("技能触发", "缺省不再显示灵魂碎片等");

		HTML_VER("2012-03-29(4.3.0.28)");
		HTML_LOG("首领报警", "首领报警更新到最新版本");
		HTML_LOG("技能触发", "优化技能触发的缺省设置");
		HTML_LOG("团队报警器", "团队报警器更新到最新版");

		HTML_VER("2012-03-28(4.3.0.27)");
		HTML_LOG("好友导入", "调整位置以显示复活卷轴");
		HTML_LOG("技能触发", "技能触发更新到最新版本");

		HTML_VER("2012-02-05(4.3.0.26)");
		HTML_LOG("幻化咨询", "查看套装效果需按住ALT键");

		HTML_VER("2012-02-02(4.3.0.25)");
		HTML_LOG("物品咨询", "增加幻化套装咨询显示");

		HTML_VER("2012-02-28(4.3.0.24)");
		HTML_LOG("职业守护", "修正术士恶魔变形不显示问题");

		HTML_VER("2012-02-27(4.3.0.23)");
		HTML_LOG("团队框架", "修正团队框架可能黑色的问题");

		HTML_VER("2012-02-23(4.3.0.22)");
		HTML_LOG("传送门条", "修正托尔巴拉德传送错误");
		HTML_LOG("点击施法", "修正点击施法对Grid的支持");
		HTML_LOG("冷却计时", "修正与LostControl的冲突");

		HTML_VER("2012-02-20(4.3.0.21)");
		HTML_LOG("首领模块", "修正了火鸟、石头人的报错");

		HTML_VER("2012-02-16(4.3.0.20)");
		HTML_LOG("首领模块", "修正可能导致客户端奔溃的问题");

		HTML_VER("2012-02-15(4.3.0.19)");
		HTML_LOG("多玩魔盒", "修正日历不显示事件的问题");

		HTML_VER("2012-02-11(4.3.0.18)");
		HTML_LOG("多玩界面", "尝试修正64位卡100%蓝条问题");

		HTML_VER("2012-02-09(4.3.0.17)");
		HTML_LOG("首领模块", "首领模块更新到最新版本");
		HTML_LOG("伤害统计", "伤害统计更新到最新版本");

		HTML_VER("2012-02-09(4.3.0.16)");
		HTML_LOG("多玩界面", "修正64位客户端卡蓝条的问题");

		HTML_VER("2012-02-02(4.3.0.15)");
		HTML_LOG("系统日历", "修正不显示副本重置时间的问题");
		HTML_LOG("首领模块", "增加自动屏蔽巨龙之魂过场动画功能");

		HTML_VER("2012-01-09(4.3.0.14)");
		HTML_LOG("竞技语音", "修正竞技语音开启设置失效问题");

		HTML_VER("2012-01-04(4.3.0.13)");
		HTML_LOG("泰坦信息条", "修正耐久不及时刷新的错误");
		HTML_LOG("战场助手", "自动离场时间改为10秒");

		HTML_VER("2011-12-31(4.3.0.12)");
		HTML_LOG("坐骑来源", "新增目标坐骑Buff来源提示");
		HTML_LOG("多玩魔盒", "开启公会银行时不再卡住");

		HTML_VER("2011-12-28(4.3.0.11)");
		HTML_LOG("技能触发", "增加潜行者'洞悉'的特效监控");
		HTML_LOG("多玩动作条", "解决动作条不显示的BUG");

		HTML_VER("2011-12-27(4.3.0.10)");
		HTML_LOG("泰坦信息条", "泰坦信息条现在将正确的载入");
		HTML_LOG("多玩动作条", "修正额外动作条不显示的错误");

		HTML_VER("2011-12-23(4.3.0.9)");
		HTML_LOG("多玩魔盒", "缺省将禁用语言过滤器");
		HTML_LOG("地图增强", "未探索区域恢复半透明效果");

		HTML_VER("2011-12-22(4.3.0.8)");
		HTML_LOG("任务查询", "未接任务显示模块更新到最新版");
		HTML_LOG("技能触发", "支持6位法术ID的自定义");

		HTML_VER("2011-12-20(4.3.0.7)");
		HTML_LOG("任务查询", "修正大地图上未接任务提示");
		HTML_LOG("拍卖助手", "修正拍卖助手配置选项错误");

		HTML_VER("2011-12-18(4.3.0.6)");
		HTML_LOG("拍卖助手", "修正物品单价显示功能");
		HTML_LOG("目标BUFF", "修正BOSS队友DEBUFF的显示");

		HTML_VER("2011-12-16(4.3.0.5)");
		HTML_LOG("副本攻略", "增加随机团队本简易攻略");

		HTML_VER("2011-12-14(4.3.0.4)");
		HTML_LOG("首领模块", "首领模块DBM更新到最新语音版");
		HTML_LOG("多玩界面", "修正改界面后不显示额外按键的错误");

		HTML_VER("2011-12-13(4.3.0.3)");
		HTML_LOG("拍卖助手", "修正拍卖助手显示BUG");

		HTML_VER("2011-12-13(4.3.0.2)");
		HTML_LOG("技能冷却", "修正不显示技能冷却的错误");
		HTML_LOG("键位保存", "屏蔽键位保存的报错信息");
		HTML_LOG("首领模块", "修正一处可能的报错");

		HTML_VER("2011-12-13(4.3.0.1)");
		HTML_LOG("多玩魔盒", "全面支持大裂变4.3国服版本");
		HTML_LOG("副本攻略", "增加新增3大5人副本简易攻略");
		HTML_LOG("副本掉落", "升级到最新版本");
		HTML_LOG("首领模块", "升级到最新语音版本");
		HTML_LOG("地图增强", "增加新副本地图信息提示");
		HTML_LOG("NPC标注", "重铸NPC位置根据4.3位置调整");
		HTML_LOG("多玩界面", "重铸、幻化、虚空银行窗口可拖动");
		HTML_LOG("多玩魔盒", "幻化界面增加魔盒帮助信息");
		HTML_LOG("采集助手", "更新采集助手数据资料模块");
		HTML_LOG("可接任务", "可接任务更新到最新版本");
		HTML_LOG("团队报警器", "更新到最新版本");
		HTML_LOG("团队框架", "增加新增团队副本Buff模块支持");
		HTML_LOG("多玩GKP", "增加巨龙之魂团队副本支持");
		HTML_LOG("多玩DKP", "增加巨龙之魂团队副本支持");
		HTML_LOG("背包整合", "增加虚空银行的随身查看");
		HTML_LOG("点击施法", "支持Grid和系统团队的点击施法");

		HTML_VER("2011-12-07(4.2.0.10)");
		HTML_LOG("属性报告", "左右键统一为详细属性报告");
		HTML_LOG("稀有精英探测", "修正无法保存配置的错误");

		HTML_VER("2011-11-14(4.2.0.9)");
		HTML_LOG("首领模块", "首领模块更新到最新版本");
		HTML_LOG("稀有精英探测", "更新稀有精英探测到最新版");

		HTML_VER("2011-10-18(4.2.0.8)");
		HTML_LOG("伤害统计", "优化新版伤害统计数据显示");
		HTML_LOG("竞技语音", "修复竞技语音不报警问题");
		HTML_LOG("装备等级", "优化查询(需对方也使用魔盒)");

		HTML_VER("2011-10-17(4.2.0.7)");
		HTML_LOG("稀有精英", "增加火焰之地数据(路径修复ing)");
		HTML_LOG("伤害统计", "修复skada不显示伤害错误");
		HTML_LOG("按键配置", "修正按键配置无法生成错误");

		HTML_VER("2011-10-14(4.2.0.6)");
		HTML_LOG("物品等级", "修复玩家物品等级查询");

		HTML_VER("2011-10-14(4.2.0.5)");
		HTML_LOG("多玩移动", "修正背包条不显示问题");
		HTML_LOG("考古助手", "地图模块增加考古助手");
		HTML_LOG("伤害统计", "添加占用更小的Skada");

		HTML_VER("2011-10-14(4.2.0.4)");
		HTML_LOG("首领模块", "DBM更新到最新语音版本");
		HTML_LOG("头像增强", "增加团队中显示小队头像选项");

		HTML_VER("2011-10-11(4.2.0.3)");
		HTML_LOG("首领模块", "修正DBM火源之地载入问题");

		HTML_VER("2011-10-11(4.2.0.2)");
		HTML_LOG("采集助手", "Ace库更新到最新版本");

		HTML_VER("2011-10-11(4.2.0.1)");
		HTML_LOG("多玩魔盒", "全面升级到4.2版本");
		HTML_LOG("背包整理", "专业物品将整理如专业背包");
		HTML_LOG("背包整合", "优化任务物品和特殊背包的显示");
		HTML_LOG("商业技能", "已经学会的配方加上明显标记");

		HTML_VER("2011-09-09(4.1.0.31)");
		HTML_LOG("一键重铸", "优化一键重铸部分属性预设");

		HTML_VER("2011-09-08(4.1.0.30)");
		HTML_LOG("首领报警", "报警文字颜色改为法师兰");

		HTML_VER("2011-09-08(4.1.0.29)");
		HTML_LOG("装备等级", "增加装备玩家装备等级查看");
		HTML_LOG("一键重铸", "修正一键重铸显示为乱码问题");
		HTML_LOG("自动拾取", "细微调整自动拾取的设置逻辑");
		HTML_LOG("技能触发", "增加禁用系统触发提示功能");

		HTML_VER("2011-09-04(4.1.0.28)");
		HTML_LOG("团队标记", "增加快速团队标记功能");
		HTML_LOG("一键重铸", "增加一键重铸全身装备助手");

		HTML_VER("2011-08-29(4.1.0.27)");
		HTML_LOG("自动战袍", "增加副本中自动更换指定战袍模块");

		HTML_VER("2011-08-25(4.1.0.26)");
		HTML_LOG("竞技语音", "修正一个可能引起不报警的错误");
		HTML_LOG("头像增强", "尝试修正3D头像显示错误问题");
		HTML_LOG("团队报警器", "团队报警器更新到最新版本");

		HTML_VER("2011-08-24(4.1.0.25)");
		HTML_LOG("焦点头像", "修正焦点头像不能及时刷新的错误");
		HTML_LOG("按键配置", "现在按键配置可以正确的使用了");
		HTML_LOG("拍卖助手", "拍卖物品削价现在改为奸商价1铜");

		HTML_VER("2011-08-23(4.1.0.24)");
		HTML_LOG("副本攻略", "增加两巨魔副本Boss攻略");

		HTML_VER("2011-08-23(4.1.0.23)");
		HTML_LOG("副本掉落", "增加巨魔新副本掉落查询");

		HTML_VER("2011-08-23(4.1.0.22)");
		HTML_LOG("头像增强", "修复TOT可能的显示不正常");
		HTML_LOG("团队框架", "增加龙母赛斯特拉模块");

		HTML_VER("2011-08-22(4.1.0.21)");
		HTML_LOG("头像增强", "恢复团队中显示小队头像设定");
		HTML_LOG("魔法增益", "增加查看Buff施法者的功能");

		HTML_VER("2011-08-21(4.1.0.20)");
		HTML_LOG("背包整合", "修正无法查看小号背包的问题");
		HTML_LOG("多玩魔盒", "修正无法战斗中点掉buff的错误");
		HTML_LOG("头像增强", "取消团队中显示队友头像设定");
		HTML_LOG("多玩聊天", "右键详细通报增加精通属性");
		HTML_LOG("Titan信息条", "增加托巴排队功能(右键菜单)");

		HTML_VER("2011-08-15(4.1.0.19)");
		HTML_LOG("拍卖助手", "修复可能的右键上货错误");
		HTML_LOG("多玩DKP", "修复多玩DKP插件的错误");

		HTML_VER("2011-08-10(4.1.0.18)");
		HTML_LOG("首领模块", "屏蔽掉过关和失败音效");

		HTML_VER("2011-08-09(4.1.0.17)");
		HTML_LOG("拍卖助手", "修正不能右键上货错误");

		HTML_VER("2011-08-08(4.1.0.16)");
		HTML_LOG("仇恨统计", "仇恨统计升级到最新版本");
		HTML_LOG("多玩魔盒", "大量优化插件内存占用");
		HTML_LOG("活动截图", "删除冲级赛活动截图模块");
		HTML_LOG("首领模块", "恢复巫妖王之怒模块");

		HTML_VER("2011-08-04(4.1.0.15)");
		HTML_LOG("属性解析", "缺省关闭造成丢帧的装备属性解析");
		HTML_LOG("增益魔法", "修正战斗中无法点掉BUFF的错误");
		HTML_LOG("传送门条", "修正托尔巴拉德传送错误(只能传送)");

		HTML_VER("2011-08-01(4.1.0.14)");
		HTML_LOG("法术助手", "重新加入法术学习助手模块");
		HTML_LOG("首领掉落", "修正副本地图首领位置错误");
		HTML_LOG("右键菜单", "修正右键增强菜单显示错误");
		HTML_LOG("队友头像", "修正队友头像间距过大问题");
		HTML_LOG("嘲讽助手", "移除可能出错的嘲讽助手");

		HTML_VER("2011-07-30(4.1.0.13)");
		HTML_LOG("属性通报", "右键详细属性根据天赋变动");
		HTML_LOG("伤害统计", "修正位置无法保存的错误");

		HTML_VER("2011-07-29(4.1.0.12)");
		HTML_LOG("掉落查询", "回复掉落查询(缺省关闭)");
		HTML_LOG("稀有精英探测", "尝试修复探测报警");
		HTML_LOG("头像增强", "修正3D头像可能的错误");
		HTML_LOG("团队框架", "添加黑翼血环Debuff模块");
		HTML_LOG("伤害统计", "升级到最新版本");
		HTML_LOG("商业技能库", "快速查询改为Ctrl+右键");
		HTML_LOG("法术计时", "更新部分计时法术数据");

		HTML_VER("2011-07-26(4.1.0.11)");
		HTML_LOG("多玩魔盒", "修正无法使用雕文的错误");
		HTML_LOG("职业辅助", "圣骑士圣能条可随意拖动");
		HTML_LOG("商业技能", "添加大裂变商业技能数据");
		HTML_LOG("装备评分", "将评分算法升级到CTM版本");

		HTML_VER("2011-07-23(4.1.0.10)");
		HTML_LOG("职业辅助", "修正毒药条覆盖潜行错误");
		HTML_LOG("NPC探测", "添加大灾变稀有精英数据");
		HTML_LOG("快速换装", "修正打开设置界面的错误");
		HTML_LOG("采集助手", "完全汉化采集助手模块");
		HTML_LOG("团队框架", "修正横向排列错位的错误");
		HTML_LOG("副本掉落", "修正起源大厅BOSS标注错误");
		HTML_LOG("图腾助手", "修正大地之盾追踪错误");

		HTML_VER("2011-07-21(4.1.0.9)");
		HTML_LOG("多玩魔盒", "优化地图载入读条速度");
		HTML_LOG("天赋模拟器", "天赋模拟器改为动态载入");
		HTML_LOG("多玩聊天", "修正聊天栏名字着色问题");
		HTML_LOG("仇恨统计", "调高仇恨统计窗口的层级");
		HTML_LOG("属性统计", "不再显示玩家自身的属性统计");
		HTML_LOG("随机坐骑", "达拉然现在可以使用飞机了");
		HTML_LOG("团队框架", "修正无法隐藏小队头像的错误");

		HTML_VER("2011-07-18(4.1.0.8)");
		HTML_LOG("首领报警", "首领报警升级到语音版");
		HTML_LOG("泰坦信息条", "不再提醒冬拥湖战斗");

		HTML_VER("2011-07-18(4.1.0.7)");
		HTML_LOG("副本攻略", "增加5人副本简易攻略");
		HTML_LOG("任务增强", "现在小地图标记不会消失了");
		HTML_LOG("地图增强", "地图高亮改为半透明样式");
		HTML_LOG("图腾助手", "修正开启配置失效的错误");

		HTML_VER("2011-07-15(4.1.0.6)");
		HTML_LOG("副本掉落", "完善副本掉落查询");
		HTML_LOG("公会查看", "增加好友面板公会标签");
		HTML_LOG("法术计时器", "修正无法缩放的错误");
		HTML_LOG("图腾助手", "现在可以正确的向上弹出了");
		
		HTML_VER("2011-07-14(4.1.0.5)");
		HTML_LOG("小地图增强", "增加大地图开启按键");
		HTML_LOG("战斗指示器", "屏幕现在更为清爽");
		HTML_LOG("战斗指示器", "修正选项面板无法移动问题");
		HTML_LOG("法术计时器", "添加术士灾祸计时");
		
		HTML_VER("2011-07-13(4.1.0.4)");
		HTML_LOG("技能触发", "技能触发改为缺省开启");
		HTML_LOG("团队报警器", "修正密语聊天失效问题");
		HTML_LOG("右键菜单", "修正右键菜单失效问题");
		
		HTML_VER("2011-07-12(4.1.0.3)");
		HTML_LOG("天赋模拟器", "增加天赋推荐模拟模块");
		HTML_LOG("技能触发", "缺省不再开启技能触发");
		HTML_LOG("世界频道", "兼容大脚世界频道");
		
		HTML_VER("2011-07-12(4.1.0.2)");
		HTML_LOG("多玩魔盒", "修正因升级到4.1版本引起的报错");
		HTML_LOG("任务指引", "添加任务指引模块");
		HTML_LOG("可接任务查询", "添加可接任务查询模块");
		HTML_LOG("一键切换", "现在可以一键切换到简洁模式");
		HTML_LOG("反和谐补丁", "正在准备中...");
	
		HTML_VER("2011-07-12(4.1.0.1)");
		HTML_LOG("多玩魔盒", "基本插件更新到4.1版本");
		HTML_LOG("活动模块", "更新冲级赛截图模块");

		HTML_VER("2011-06-08(3.3.0.44)");
		HTML_LOG("团队报警器", "更新至最新版本");
		HTML_LOG("职业助手", "增加术士快速召唤宠物功能");
		HTML_LOG("金团助手", "修正添加物品信息错误问题");
		HTML_LOG("技能触发", "支持更多技能触发提示");

		HTML_VER("2011-05-11(3.3.0.43)");
		HTML_LOG("副本掉落", "增加红玉圣殿副本掉落查询");
		HTML_LOG("增益魔法", "可以自己设置BUFF的尺寸了");
		HTML_LOG("快速标记", "快速标记现在可以正确关闭了");
		HTML_LOG("聊天增强", "尝试修正聊天栏职业着色错误");
		HTML_LOG("副本掉落", "恢复小地图快捷按钮");

		HTML_VER("2011-05-3(3.3.0.42)");
		HTML_LOG("头像增强", "修正队友等级不即时刷新的错误");
		HTML_LOG("BUFF计时", "微调目标BUFF计时字体大小");

		HTML_VER("2011-05-1(3.3.0.41)");
		HTML_LOG("头像增强", "增加显示隐藏队友BUFF选项");
		HTML_LOG("首领模块", "增加监控团队技能冷却模块");
		HTML_LOG("魔法增益", "缺省将显示目标BUFF计时");
		HTML_LOG("聊天增强", "转发频道将不再显示转发人");
		HTML_LOG("地图增强", "增加稀有精英探测模块");

		HTML_VER("2011-04-24(3.3.0.40)");
		HTML_LOG("随机坐骑", "修正可能出现小鸟的坑爹问题");
		HTML_LOG("头像增强", "修正队友的目标显示错误问题");

		HTML_VER("2011-04-22(3.3.0.39)");
		HTML_LOG("多玩移动", "更名为多玩界面");
		HTML_LOG("多玩移动", "调整界面方式更加直观");
		HTML_LOG("多玩魔盒", "优化多玩魔盒内存占用");
		HTML_LOG("物品咨询", "缺省不再开启使用在树状列表");
		HTML_LOG("多玩魔盒", "优化解决战斗中卡载具的方案");
		HTML_LOG("猎人助手", "修复自动切换追踪技能的错误");
		HTML_LOG("随机坐骑", "修复可能使用低级坐骑的错误");
		HTML_LOG("随机坐骑", "优化在冬拥湖使用坐骑的判定");
		HTML_LOG("多玩魔盒", "精简基本库非必要的库文件");
		HTML_LOG("任务增强", "优化任务监视栏的缺省定位");
		HTML_LOG("任务增强", "魔盒将缺省为你选择最贵奖品");
		HTML_LOG("首领模块", "增加首领模块计时条移动选项");
		HTML_LOG("多玩界面", "修正主动作条定位偏移错误");
		HTML_LOG("魔法增益", "重新定义玩家BUFF时间格式");
		HTML_LOG("毒药条", "潜行图标进入潜行后更加明显");
		HTML_LOG("队友头像", "修正可能出现的头像混乱问题");
		HTML_LOG("焦点头像", "修正焦点头像双状态显示问题");
		HTML_LOG("多玩魔盒", "微调宠物动作条位置");

		HTML_VER("2011-04-09(3.3.0.38)");
		HTML_LOG("多玩移动", "修正变形后无法点击动作条的错误");
		HTML_LOG("多玩移动", "非萨满玩家将不再显示图腾条选项");
		HTML_LOG("头像增强", "队友施法条样式进行了全新的设计");

		HTML_VER("2011-04-09(3.3.0.37)");
		HTML_LOG("多玩移动", "优化切换回缺省方案的效果");		

		HTML_VER("2011-04-08(3.3.0.36)");
		HTML_LOG("多玩魔盒", "修正使用法术书施法的错误");
		HTML_LOG("头像增强", "将正确显示精英目标连击点");

		HTML_VER("2011-04-08(3.3.0.35)");
		HTML_LOG("头像增强", "兼容Xperl等流行头像");
		HTML_LOG("微型菜单", "兼容BT4等流行动作条");		

		HTML_VER("2011-04-08(3.3.0.34)");
		HTML_LOG("头像增强", "载具头像现在更加美观");
		HTML_LOG("多玩移动", "修正变形后卡载具问题");		

		HTML_VER("2011-03-31(3.3.0.33)");
		HTML_LOG("动作条美化", "修复动作条美化错误");

		HTML_VER("2011-03-31(3.3.0.32)");
		HTML_LOG("多玩移动", "优化多玩移动动作条模块");

		HTML_VER("2011-03-25(3.3.0.31)");
		HTML_LOG("猎人助手", "自动切换追踪现在将正确工作");
		HTML_LOG("猎人助手", "增加眩晕时自动取消豹守功能");

		HTML_VER("2011-03-24(3.3.0.30)");
		HTML_LOG("团队报警器", "更新到最新版本");

		HTML_VER("2011-03-23(3.3.0.29)");
		HTML_LOG("技能触发", "修复可能不显示触发问题");

		HTML_VER("2011-03-19(3.3.0.28)");
		HTML_LOG("图腾助手", "优化SM图腾助手缺省设置");

		HTML_VER("2011-03-17(3.3.0.27)");
		HTML_LOG("技能触发", "修正生命分流不显示问题");

		HTML_VER("2011-03-17(3.3.0.26)");
		HTML_LOG("技能触发", "增加T10套装触发提示");
		HTML_LOG("任务查询", "修正任务查询导致的报错");

		HTML_VER("2011-03-16(3.3.0.25)");
		HTML_LOG("图腾助手", "增加萨满图腾助手模块");

		HTML_VER("2011-03-12(3.3.0.24)");
		HTML_LOG("竞技助手", "增加竞技场被集火通报");
		HTML_LOG("技能触发", "更新技能触发到最新版");

		HTML_VER("2011-03-10(3.3.0.23)");
		HTML_LOG("多玩移动", "修正主动做条的问题");

		HTML_VER("2011-03-10(3.3.0.22)");
		HTML_LOG("多玩魔盒", "改善内存占用情况");

		HTML_VER("2011-03-01(3.3.0.21)");
		HTML_LOG("多玩动作条", "修正缩放定位错误");
		HTML_LOG("多玩动作条", "增加简单的自动对齐功能");
		HTML_LOG("多玩移动", "增加简单的自动对齐功能");

		HTML_VER("2011-03-01(3.3.0.20)");
		HTML_LOG("多玩聊天", "增加Tab键频道切换功能");

		HTML_VER("2011-02-25(3.3.0.19)");
		HTML_LOG("鼠标提示", "距离提示现在将实时刷新");
		HTML_LOG("聊天过滤", "屏蔽世界频道进出消息");

		HTML_VER("2011-02-23(3.3.0.18)");
		HTML_LOG("鼠标提示", "增加目标距离显示项");
		HTML_LOG("法术计时", "完善各职业计时法术");
		HTML_LOG("团队助手", "邀请文字可设为单字");

		HTML_VER("2011-02-17(3.3.0.17)");
		HTML_LOG("随机坐骑", "新增智能随机坐骑宏");
		HTML_LOG("物品信息", "增加镶嵌的宝石信息");

		HTML_VER("2011-02-15(3.3.0.16)");
		HTML_LOG("首领模块", "更新首领模块到最新版本");
		HTML_LOG("频道转发", "现在交易频道将正确转发");

		HTML_VER("2011-01-28(3.3.0.15)");
		HTML_LOG("装备信息", "观察窗口添加刷新按键");
		HTML_LOG("竞技语音", "添加竞技场技能语音报警");
		HTML_LOG("任务查询", "可查询低级可接任务信息");

		HTML_VER("2011-01-27(3.3.0.14)");
		HTML_LOG("伤害统计", "盾吸收将正确算入治疗");
		HTML_LOG("装备信息", "修正宝石和天赋显示错误");
		HTML_LOG("拍卖助手", "修正批量购买的错误");

		HTML_VER("2011-01-26(3.3.0.13)");
		HTML_LOG("技能触发", "修正熔火之心不显示问题");

		HTML_VER("2011-01-25(3.3.0.12)");
		HTML_LOG("一键驱散", "更新到最新版本");

		HTML_VER("2011-01-25(3.3.0.11)");
		HTML_LOG("多玩聊天", "修正实名聊天的bug");
		HTML_LOG("伤害统计", "更新到最新版本");

		HTML_VER("2011-01-25(3.3.0.10)");
		HTML_LOG("任务增强", "增加任务小地图标记功能");
		HTML_LOG("任务查询", "缺省不再开启任务查询");
		HTML_LOG("泰坦信息条", "修正可能的不显示问题");

		HTML_VER("2011-01-23(3.3.0.9)");
		HTML_LOG("任务日志", "修正右边区域点击失效问题");
		HTML_LOG("装备信息", "修正宝石镶嵌信息可能错误");
		HTML_LOG("多玩聊天", "修正聊天通道频道切换问题");
		
		HTML_VER("2011-01-23(3.3.0.8)");
		HTML_LOG("物品信息", "添加物品质量显示(色盲辅助)");
		HTML_LOG("密语聊天", "修正密语聊天选项按钮错误");
		HTML_LOG("便捷工具", "恢复好友导入功能");
		HTML_LOG("任务查询", "修正任务查询按钮错位问题");
		HTML_LOG("现行冷却", "没有冷却法术时透明化处理");
		HTML_LOG("首领模块", "首领模块更新到最新版本");

		HTML_VER("2011-01-22(3.3.0.7)");
		HTML_LOG("多玩聊天", "聊天栏现在缺省可互动");
		HTML_LOG("首领模块", "修正奥杜尔本地化错误");
		HTML_LOG("多玩移动", "修正Buff框架移动错误");

		HTML_VER("2011-01-21(3.3.0.6)");
		HTML_LOG("多玩聊天", "增加转发频道屏蔽按键");
		HTML_LOG("多玩魔盒", "调整小地图按键的位置");

		HTML_VER("2011-01-21(3.3.0.5)");
		HTML_LOG("多玩魔盒", "修正系统聊天粘滞的问题");
		HTML_LOG("拍卖助手", "修正拍卖助手已知的错误");
		HTML_LOG("装备掉落", "添加冰冠堡垒新副本掉落");
		HTML_LOG("团队通告", "缺省改为关闭团队通告");

		HTML_VER("2011-01-20(3.3.0.4)");
		HTML_LOG("右键菜单", "添加删除好友等菜单项");
		HTML_LOG("多玩魔盒", "修正聊天输入框的错误");

		HTML_VER("2011-01-20(3.3.0.3)");
		HTML_LOG("随机副本", "不再收起小地图按键");
		HTML_LOG("多玩聊天", "尝试加入交易频道转发");
		HTML_LOG("任务追踪", "增加Shift-左键移动功能");

		HTML_VER("2011-01-20(3.3.0.2)");
		HTML_LOG("地图增强", "修正地图增强的错误");

		HTML_VER("2011-01-19(3.3.0.1)");
		HTML_LOG("多玩魔盒", "全面支持3.3.5国服巫妖王");
		HTML_LOG("首领站位", "移除首领站位模块");
		HTML_LOG("团长助手", "增加团长助手模块");
		HTML_LOG("团长助手", "增加团队通告模块");
		HTML_LOG("多玩聊天", "增加组队频道转发模块");

		HTML_VER("2011-01-09(3.2.0.61)");
		HTML_LOG("金团助手", "增加小队分配报表信息");
		HTML_LOG("法术计时", "补充完善计时法术信息");

		HTML_VER("2011-01-06(3.2.0.60)");
		HTML_LOG("属性报告", "修正天赋显示错误问题");

		HTML_VER("2011-01-06(3.2.0.59)");
		HTML_LOG("金团助手", "修正可能产生混乱的错误");
		HTML_LOG("多玩聊天", "增加玩家属性发送快捷键");
		HTML_LOG("头像增强", "兼容经验条和小德法力条");

		HTML_VER("2010-12-28(3.2.0.58)");
		HTML_LOG("一键施法", "恢复一键施法模块");
		HTML_LOG("多玩符文条", "增加职业模块选项");
		HTML_LOG("伤害输出", "修正治疗爆击显示问题");
		HTML_LOG("鼠标提示", "屏蔽Loading文字提示");

		HTML_VER("2010-12-27(3.2.0.57)");
		HTML_LOG("一键施法", "删除一键施法模块");
		HTML_LOG("施法通告", "删除施法通告模块");
		HTML_LOG("破控警告", "删除破控警告模块");
		HTML_LOG("伤害统计", "修正有时不统计的问题");
		HTML_LOG("装备信息", "修正装备信息显示问题");	

		HTML_VER("2010-12-22(3.2.0.56)");
		HTML_LOG("装备评分", "评分超过7K时修正着色");
		HTML_LOG("头像增强", "增加shift+左键移动功能");
		HTML_LOG("战斗指示", "修正伤害输出治疗问题");
		HTML_LOG("多玩符文条", "对XPerl头像做兼容处理");

		HTML_VER("2010-12-20(3.2.0.55)");
		HTML_LOG("团队框架", "增加阿努巴拉克刺骨治疗模块");

		HTML_VER("2010-12-17(3.2.0.54)");
		HTML_LOG("多玩魔盒", "守护毒药条更名为职业守护条");
		HTML_LOG("战斗指示", "修复战斗伤害信息混乱的问题");
		HTML_LOG("多玩魔盒", "多玩符文条增加对单体的兼容");
		HTML_LOG("泰坦信息条", "尝试修正信件状态延迟问题");

		HTML_VER("2010-12-16(3.2.0.53)");
		HTML_LOG("简易状态", "修正可能出现的定位问题");
		HTML_LOG("战斗指示", "增加DCT的伤害输出模块");
		HTML_LOG("职业辅助", "DK符文条增加移动和缩放功能");
		HTML_LOG("技能冷却", "中心图标增加自定义位置选项");

		HTML_VER("2010-12-15(3.2.0.52)");
		HTML_LOG("简易状态", "增加自定义显示位置功能");
		HTML_LOG("团队框架", "修正不显示预读治疗的Bug");
		HTML_LOG("拍卖助手", "修正缺少库文件引起的错误");

		HTML_VER("2010-12-15(3.2.0.51)");
		HTML_LOG("技能冷却", "关闭可能出现的冷却条");

		HTML_VER("2010-12-14(3.2.0.50)");
		HTML_LOG("简易状态", "重新设计了界面和功能");
		HTML_LOG("金团助手", "增加魔盒金团助手模块");
		HTML_LOG("冷却计时", "增加中心冷却图标选项");

		HTML_VER("2010-12-8(3.2.0.49)");
		HTML_LOG("多玩魔盒", "精简多玩基本库");
		HTML_LOG("装备信息", "补全装备掉落信息");
		HTML_LOG("内置语音", "屏蔽频道菜单和飞机票");
		HTML_LOG("组队语音", "屏蔽自动组队语音功能");

		HTML_VER("2010-11-29(3.2.0.48)");
		HTML_LOG("职业助手", "增加术士恶魔变形法术");

		HTML_VER("2010-11-29(3.2.0.47)");
		HTML_LOG("职业助手", "增加术士召唤动作条");
		HTML_LOG("内置语音", "开放自动组队语音功能");
		HTML_LOG("内置语音", "增加快捷切换频道菜单");
		HTML_LOG("内置语音", "支持 yy://频道ID 链接");
		HTML_LOG("多玩魔盒", "修正盗贼缺省界面载具问题");

		HTML_VER("2010-11-18(3.2.0.46)");
		HTML_LOG("团队助手", "更新团队助手到最新版本");

		HTML_VER("2010-11-18(3.2.0.45)");
		HTML_LOG("团队框架", "缺省将显示团队标记");
		HTML_LOG("密语记录", "添加密语闪烁提示");
		HTML_LOG("NPC标记", "更新NPC数据");
		HTML_LOG("任务查询", "更新任务数据");

		HTML_VER("2010-11-17(3.2.0.44)");
		HTML_LOG("首领站位", "恢复首领站位模块");
		HTML_LOG("副本地图", "添加诺森德地图查询");
		HTML_LOG("自动售卖", "交易后显示售卖获利");
		HTML_LOG("传送门条", "修复传送门条显示bug");

		HTML_VER("2010-11-14(3.2.0.43)");
		HTML_LOG("多玩魔盒", "优化宠物条的外观显示");
		HTML_LOG("毒药守护条", "修正潜行按键错位的bug");

		HTML_VER("2010-11-13(3.2.0.42)");
		HTML_LOG("多玩魔盒", "修正宠物动作条定位的bug");
		HTML_LOG("多玩魔盒", "加强与BT4动作条的兼容性");
		HTML_LOG("聊天泡泡", "增加团队中隐藏的选项");

		HTML_VER("2010-11-11(3.2.0.41)");
		HTML_LOG("多玩魔盒", "修正缺省界面下卡载具的问题");
		HTML_LOG("团队助手", "团队助手更新到国服最新版本");
		
		HTML_VER("2010-11-9(3.2.0.40)");
		HTML_LOG("聊天泡泡", "添加组队聊天泡泡插件");

		HTML_VER("2010-11-5(3.2.0.39)");
		HTML_LOG("属性统计", "修正一处引起报错的BUG");

		HTML_VER("2010-11-4(3.2.0.38)");
		HTML_LOG("魔法增益", "修正系统Buff计时问题");
		HTML_LOG("活动插件", "屏蔽魔枢竞速赛活动插件");

		HTML_VER("2010-11-3(3.2.0.37)");
		HTML_LOG("收支统计", "增加收支统计模块");

		HTML_VER("2010-10-30(3.2.0.36)");
		HTML_LOG("活动插件", "增加保存信息按键");

		HTML_VER("2010-10-29(3.2.0.35)");
		HTML_LOG("竞速比赛", "修正无法上传成绩的错误");
		HTML_LOG("竞速比赛", "原来的比赛数据不会丢失");
		HTML_LOG("竞速比赛", "详情咨询魔盒官方频道YY:23");

		HTML_VER("2010-10-29(3.2.0.34)");
		HTML_LOG("多玩魔盒", "修正竞速赛插件bug");

		HTML_TITLE("更新日志:");
		HTML_VER("2010-10-29(3.2.0.33)");
		HTML_LOG("多玩魔盒", "更新多玩魔枢竞速赛插件");

		HTML_VER("2010-10-26(3.2.0.32)");
		HTML_LOG("多玩DKP", "尝试修正TOC三号不弹框的Bug");
		HTML_LOG("副本掉落", "修正黑龙公主掉落错误");

		HTML_VER("2010-10-21(3.2.0.31)");
		HTML_LOG("NPC标记", "勾选状态将会正确记录");
		HTML_LOG("拍卖助手", "修正一处本地化错误");
		HTML_LOG("商业技能库", "按键布局重新调整");

		HTML_VER("2010-10-19(3.2.0.30)");
		HTML_LOG("拍卖助手", "修正一处本地化错误");

		HTML_VER("2010-10-13(3.2.0.29)");
		HTML_LOG("首领报警", "更新到最新版本");
		HTML_LOG("副本掉落", "更新到最新版本");
		HTML_LOG("泰坦信息条", "添加冬拥湖计时器");
		HTML_LOG("泰坦信息条", "按住Shift点时间调出计时器");
		HTML_LOG("一键换装", "添加按钮数量设置项");

		HTML_VER("2010-10-11(3.2.0.28)");
		HTML_LOG("团队助手", "修正就位检查显示错误");

		HTML_VER("2010-10-10(3.2.0.27)");
		HTML_LOG("聊天增强", "修正解散宠物时聊天栏错位的错误");
		HTML_LOG("技能触发", "修正圣洁护盾计时错误");
		HTML_LOG("技能触发", "添加猛兽攻击触发计时");
		HTML_LOG("团队框架", "修正检查准备显示错误");
		HTML_LOG("法术计时", "修正野蛮咆哮不计时错误");

		HTML_VER("2010-10-1(3.2.0.26)");
		HTML_LOG("多玩菜单栏", "修正不显示多玩菜单栏的Bug");

		HTML_VER("2010-9-29(3.2.0.25)");
		HTML_LOG("背包整理", "修正不能整理银行的Bug");
		HTML_LOG("拍卖助手", "修正右键添加拍卖物品的Bug");

		HTML_VER("2010-9-28(3.2.0.24)");
		HTML_LOG("背包整合", "替换成更好的Combuctor");
		HTML_LOG("团队报警", "更新到国服最新版本");
		HTML_LOG("法术计时器", "补全需要计时的法术");
		HTML_LOG("泰坦信息条", "修正金币统计不保存信息的错误");
		HTML_LOG("首领站位", "添加首领站位插件AVRE");

		HTML_VER("2010-9-26(3.2.0.23)");
		HTML_LOG("物品信息", "装备比较将显示具体的属性点差异");
		HTML_LOG("魔法增益", "自己施放于目标的Buff将更易辨识");
		HTML_LOG("物品信息", "提示中显示不同角色的该物品信息");
		HTML_LOG("焦点头像", "焦点头像的Buff显示更加合理和清晰");

		HTML_VER("2010-9-20(3.2.0.22)");
		HTML_LOG("饰品管理", "修正自动切换马鞭的错误");
		HTML_LOG("拍卖助手", "修正右键使用物品的错误");
		HTML_LOG("物品信息", "修正不显示物品售价的错误");
		HTML_LOG("头像增强", "修正使用载具时引起的错误");

		HTML_VER("2010-9-17(3.2.0.21)");
		HTML_LOG("饰品管理", "修正饰品管理初始化错误");
		HTML_LOG("拍卖助手", "增加批量购买和拍卖功能");

		HTML_VER("2010-9-16(3.2.0.20)");
		HTML_LOG("多玩魔盒", "尝试修复卡动作条的bug");
		HTML_LOG("背包整合", "修正一处可能的语法错误");

		HTML_VER("2010-9-16(3.2.0.19)");
		HTML_LOG("聊天增强", "增加密语聊天模块");

		HTML_VER("2010-9-15(3.2.0.18)");
		HTML_LOG("多玩DKP", "修正多玩DKP已知Bug");
		HTML_LOG("饰品管理", "修正饰品管理菜单错误");

		HTML_VER("2010-9-15(3.2.0.17)");
		HTML_LOG("首领掉落", "添加地图首领掉落查询");
		HTML_LOG("团队框架", "增加点击施法配置选项");
		HTML_LOG("团队框架", "缺省不再进行自动调整");
		HTML_LOG("多玩聊天", "缺省隐藏聊天通道标签");	
		HTML_LOG("拍卖助手", "允许和别的窗口同时打开");	
		HTML_LOG("多玩基本库", "Esc菜单增加魔盒配置项");

		HTML_VER("2010-9-14(3.2.0.16)");
		HTML_LOG("首领模块", "更新首领模块到最新版本");
		HTML_LOG("饰品管理", "拥有了自动排队和缩放等功能");		

		HTML_VER("2010-9-12(3.2.0.15)");
		HTML_LOG("队友Buff", "修复不显示鼠标提示的错误");

		HTML_VER("2010-9-10(3.2.0.14)");
		HTML_LOG("技能触发", "添加移动提示图标位置选项");
		HTML_LOG("商业助手", "添加材料购买数量配置选项");
		HTML_LOG("任务查询", "添加小地图显示任务标记功能");
		HTML_LOG("多玩DKP", "多玩DKP现在可以正常使用了");
		HTML_LOG("背包整合", "修正背包整合不保存位置的错误");
		HTML_LOG("法术计时", "再次补充部分职业需计时法术");
		HTML_LOG("商业技能库", "快捷查询键改为Ctrl + 左键");
		HTML_LOG("聊天增强", "聊天快捷栏支持自定义频道");
		HTML_LOG("多玩动作条", "增加动作条缩放菜单选项");

		HTML_VER("2010-9-7(3.2.0.13)");
		HTML_LOG("多玩基本库", "修正团队分页翻页问题");
		HTML_LOG("聊天增强", "重新调整聊天输入框位置");
		HTML_LOG("多玩移动", "添加对萨满图腾条的支持");

		HTML_VER("2010-9-7(3.2.0.12)");
		HTML_LOG("职业辅助", "添加猎人追踪自动切换功能");
		HTML_LOG("拍卖助手", "添加物品查询记录菜单");
		HTML_LOG("聊天增强", "重新布置聊天输入框位置");
		HTML_LOG("团队框架", "增加治疗预读信息提示");
		HTML_LOG("任务增强", "去掉任务通告中的[魔盒]字样");
		HTML_LOG("聊天增强", "尝试修复人物等级错误问题");

		HTML_VER("2010-9-5(3.2.0.11)");
		HTML_LOG("任务增强", "补全鼠标任务提示功能");

		HTML_VER("2010-9-5(3.2.0.10)");
		HTML_LOG("任务增强", "任务追踪改为左对齐方式");

		HTML_VER("2010-9-4(3.2.0.9)");
		HTML_LOG("法术计时器", "修正图腾计时错误");

		HTML_TITLE("更新日志:");
		HTML_VER("2010-9-4(3.2.0.8)");
		HTML_LOG("毒药条", "修正盗贼毒药显示不完全的错误");
		HTML_LOG("毒药条", "拥有和姿态条相同的快捷键");
		HTML_LOG("简易状态", "优化目标魔法值显示效果");
		HTML_LOG("头像增强", "微调玩家3D头像边框效果");
		HTML_LOG("魔法增益", "修正队友魔法增益不消失bug");
		HTML_LOG("法术计时器", "补充大量计时法术");

		HTML_VER("2010-9-3(3.2.0.7)");
		HTML_LOG("任务查询", "修正追踪窗口错位的bug");
		HTML_LOG("聊天增强", "修正聊天窗口和毒药条位置冲突的问题");

		HTML_VER("2010-9-2(3.2.0.6)");
		HTML_LOG("任务查询", "任务追踪可以查询结束NPC了");
		HTML_LOG("任务增强", "修正任务日志点击错乱的bug");

		HTML_VER("2010-9-1(3.2.0.5)");
		HTML_LOG("队友Buff", "增益魔法中增加开启选项");
		HTML_LOG("任务助手", "弹出菜单改为Shift+右键");

		HTML_VER("2010-9-1(3.2.0.4)");
		HTML_LOG("任务查询", "增加大脚任务查询方式选项");

		HTML_VER("2010-9-1(3.2.0.3)");
		HTML_LOG("任务追踪", "修正个别出现无法追踪的错误");
		HTML_LOG("任务查询", "数字按钮将同时查询结束NPC");

		HTML_VER("2010-8-31(3.2.0.2)");
		HTML_LOG("任务查询", "添加任务查询数据");

		HTML_VER("2010-8-31(3.2.0.1)");
		HTML_LOG("多玩魔盒", "全面支持国服巫妖王");

		HTML_VER("2010-8-29(3.1.0.35)");
		HTML_LOG("头像增强", "修正3D头像显示不正确的问题");

		HTML_VER("2010-8-28(3.1.0.34)");
		HTML_LOG("聊天增强", "修正无法关闭聊天通道的错误");
		HTML_LOG("拍卖助手", "修正不显示拍卖行价格的错误");
		HTML_LOG("线性冷却", "修正无法正确关闭的错误");
		HTML_LOG("背包整合", "交易时将自动打开背包了");
		HTML_LOG("冷却计时", "超出距离染色将正确的渲染了");

		HTML_VER("2010-8-26(3.1.0.33)");
		HTML_LOG("聊天增强", "添加交易和综合等快捷键");
		HTML_LOG("聊天增强", "切换频道后原文字将会保留");
		HTML_LOG("多玩动作条", "修正多玩动作条关闭的错误");
		HTML_LOG("制作增强", "制作界面添加切换标签");

		HTML_VER("2010-8-26(3.1.0.32)");
		HTML_LOG("采集助手", "修正采集助手引起的报错");
		HTML_LOG("团队框架", "将正确的显示怒气和能量了");
		HTML_LOG("插件分类", "所有插件重新进行详细的分类");
		
		HTML_VER("2010-8-24(3.1.0.31)");
		HTML_LOG("仇恨统计", "修复仇恨统计不显示的错误");
		HTML_LOG("多玩移动", "修复无法移动宠物条的错误");

		HTML_VER("2010-8-23(3.1.0.30)");
		HTML_LOG("战场助手", "修复战斗助手配置失效的bug");
		HTML_LOG("多玩基本库", "修正游戏中无法观看过场动画的错误");
		HTML_LOG("法术计时器", "添加盗贼毒药计时, 修正切割计时");
		HTML_LOG("泰坦信息条", "兼容小地图自定义");
		HTML_LOG("动作条皮肤", "修正缺省界面换肤的问题");
		HTML_LOG("任务增强", "进入副本将自动最小化追踪窗口");
		HTML_LOG("鼠标提示", "修正冬握湖城墙生命不显示的问题");
		HTML_LOG("饰品管理", "添加快速按键绑定功能");
		HTML_LOG("快捷菜单栏", "增加多玩快捷菜单栏");
		HTML_LOG("头像增强", "增加宠物头像扩展");
		HTML_LOG("宠物条", "宠物条将自适应毒药条移动");
		HTML_LOG("地图增强", "增加地图增强插件Mapster");
		HTML_LOG("任务查询", "全面支持国服版巫妖王");
		HTML_LOG("一键换装", "修正团队中隐藏引起的逻辑错误");
		HTML_LOG("泰坦信息条", "邮件助手不再隐藏小地图提示");
		HTML_LOG("任务追踪", "全面改进任务追踪");

		HTML_VER("2010-7-30(3.1.0.29)");
		HTML_LOG("团队报警", "修复团队报警报错");
		HTML_LOG("仇恨统计", "修复仇恨统计报错");

		HTML_VER("2010-7-30(3.1.0.28)");
		HTML_LOG("所有插件", "与台服版本同步");

		HTML_VER("2010-7-6(3.1.0.27)");
		HTML_LOG("多玩基本库", "修正可能出现的bug");

		HTML_VER("2010-7-5(3.1.0.26)");
		HTML_LOG("多玩基本库", "修复战斗结束后卡机的bug");
		HTML_LOG("多玩移动", "修复多玩移动保存配置的bug");	
		HTML_LOG("多玩动作条", "修正无法使用装备宏的bug");	

		HTML_VER("2010-6-17(3.1.0.25)");
		HTML_LOG("毒药守护条", "重新实现后不再卡机");	

		HTML_VER("2010-6-9(3.1.0.24)");
		HTML_LOG("首领模块", "修复DBM战场模块BUG");	

		HTML_VER("2010-5-31(3.1.0.23)");
		HTML_LOG("错误提示", "屏蔽错误提示弹出");	
		HTML_LOG("配置界面", "美化设置界面");	

		HTML_VER("2010-5-12(3.1.0.22)");
		HTML_LOG("副本掉落", "修复副本掉落查询的错误");	
		HTML_LOG("毒药守护条", "暂时屏蔽毒药姿态条");	

		HTML_VER("2010-5-12(3.1.0.21)");
		HTML_LOG("自动购买", "修复自动购买引起的报错");	
		HTML_LOG("基本库", "再次打开配置时显示关闭前的界面");	

		HTML_VER("2010-5-10(3.1.0.20)");
		HTML_LOG("毒药守护条", "尝试修复卡机的问题");	
		HTML_LOG("自动购买", "加入自动购买施法材料的功能");	
		HTML_LOG("基本库", "更新Ace库版本");	

		HTML_VER("2010-5-3(3.1.0.19)");
		HTML_LOG("职业辅助", "法师拥有了传送姿态条");

		HTML_VER("2010-4-30(3.1.0.18)");
		HTML_LOG("职业辅助", "潜行者拥有了毒药姿态条");	
		HTML_LOG("爱心功能", "添加很有爱心的双采工具");
		HTML_LOG("调试信息", "关闭团队插件时不再报错");
		HTML_LOG("伤害输出", "基本伤害输出能正常关闭了");
		HTML_LOG("仇恨统计", "修正仇恨统计的细微BUG");
		HTML_LOG("字体相关", "物品数量字体更易辨识");
		HTML_LOG("猎人助手", "喂食宠物进度条将正常显示");

		HTML_VER("2010-4-29(3.1.0.17)");
		HTML_LOG("多玩移动", "不再会出现堆栈溢出了");
		HTML_LOG("多玩DKP", "加入多玩原DKP插件");
		HTML_LOG("近战进度条", "添加近战进度条模块");
		HTML_LOG("拍卖助手", "新增防一口价防伪功能");
		HTML_LOG("杂项改动", "精简ACE库以减少资源占用");

		HTML_VER("2010-4-24(3.1.0.16)");
		HTML_LOG("多玩移动", "修正已知的全部问题");	
		HTML_LOG("多玩移动", "配置界面不会跑出屏幕了");

		HTML_VER("2010-4-23(3.1.0.15)");
		HTML_LOG("多玩移动", "修正潜行结束后的BUG");	
		HTML_LOG("首领模块", "汉化部分toc信息");

		HTML_VER("2010-4-23(3.1.0.14)");
		HTML_LOG("多玩移动", "修正切换形态时报错");	
		HTML_LOG("多玩移动", "修正控制怪物时报错");
		HTML_LOG("多玩移动", "感谢炽火提供的帮助");		

		HTML_VER("2010-4-23(3.1.0.13)");
		HTML_LOG("多玩移动", "修正菜单条消失BUG");	
		HTML_LOG("银行整合", "银行整合可以交换物品了");
		HTML_LOG("首领模块", "现在可以加载TBC模块了");
		HTML_LOG("战斗指示", "添加伤害输出项(系统功能)");
		HTML_LOG("聊天增强", "增加一个聊天通道分页");
		HTML_LOG("拾取模块", "添加自动拾取项(系统功能)");

		HTML_VER("2010-4-22(3.1.0.12)");
		HTML_LOG("多玩移动", "修正锁定后界面移位BUG");
		HTML_LOG("多玩移动", "缩放的时候窗口不再移动");
		
		HTML_VER("2010-4-22(3.1.0.11)");
		HTML_LOG("多玩移动", "界面移动现在可以使用了");
		HTML_LOG("聊天增强", "修正聊天分页引起的BUG");
		HTML_LOG("团队模块", "修正DBM引起的BUG");

		HTML_VER("2010-4-20(3.1.0.10)");
		HTML_LOG("多玩移动", "新增界面移动功能");
		HTML_LOG("交易增强", "修正值发送密语的错误");
		HTML_LOG("施法计时", "现在可以正确的显示时间了");
		HTML_LOG("一键换装", "新增一键换装模块");
		HTML_LOG("首领模块", "改为更好用的DBM");
		HTML_LOG("聊天增强", "修正分页重叠的BUG");

		HTML_VER("2010-4-15(3.1.0.9)");
		HTML_LOG("猎人助手", "守护条载入时将正确显示");
		HTML_LOG("施法计时", "修正施法计时的nil报错");
		HTML_LOG("背包整合", "增加拖动改变排列功能");
		HTML_LOG("模块命名", "各个模块的命名更加易懂");
		HTML_LOG("聊天增强", "增加聊天自动分页功能");
		HTML_LOG("交易增强", "你可以选择通报的频道了");

		HTML_VER("2010-4-10(3.1.0.8)");
		HTML_LOG("猎人助手", "修复因本地化信息报错");
		HTML_LOG("插件管理", "左上角增加额外提示信息");

		HTML_VER("2010-4-8(3.1.0.7)");
		HTML_LOG("头像增强", "现在队友头像扩展可以关闭了");
		HTML_LOG("战斗指示器", "加入预设特效法术报警");
		HTML_LOG("特效指示器", "加入EventAlert, 缺省关闭");
		HTML_LOG("多玩动作条", "支持转换天赋时切换技能");
		HTML_LOG("多玩动作条", "Shift+右键取消法术设置");
		HTML_LOG("多玩动作条", "增加按键绑定功能");
		HTML_LOG("人物属性", "人物属性面板显示维修费用");
		HTML_LOG("延迟施法条", "加入施法剩余时间显示");	

		HTML_VER("2010-4-6(3.1.0.6)");
		HTML_LOG("团队插件", "增加团队插件标签");
		HTML_LOG("团队插件", "现在有了快捷的配置");
		HTML_LOG("仇恨统计", "跟/show说拜拜吧");
		HTML_LOG("伤害统计", "跟仇恨统计握手吧");
		HTML_LOG("团队报警", "增加RaidAlerter利器");
		HTML_LOG("猎人助手", "增加自动射击计时条");
		HTML_LOG("任务增强", "修正LinkButton报错");
		HTML_LOG("图腾助手", "图腾条缺省可以施法了");
		HTML_LOG("DCT", "删除伤害输出模块");
		HTML_LOG("ACE库", "修正属性统计逻辑错误");

		HTML_VER("2010-4-4(3.1.0.5)");
		HTML_LOG("多玩动作条", "紧急修复Push报错");

		HTML_VER("2010-4-4(3.1.0.4)");
		HTML_LOG("更新日志", "点击版本号可查看更新日志");
		HTML_LOG("鼠标提示", "增加副天赋信息显示");
		HTML_LOG("杂项改动", "在toc中加入多玩插件标志");

		HTML_VER("2010-4-3(3.1.0.3)");
		HTML_LOG("增强地图", "汉化地图上按键信息");
		HTML_LOG("基本库", "动态载入插件现在将正确触发");
		HTML_LOG("猎人模块", "增加守护动作条");
		HTML_LOG("背包整理", "按键提示文字改为系统风格");
		HTML_LOG("聊天助手", "聊天框文字以缺省字体显示");
		HTML_LOG("商业技能库", "去掉toc里多余的依赖标签");
		HTML_LOG("基本库", "团队插件后加上相应的英文名");
		HTML_LOG("多玩动作条", "增加宏、坐骑等支持");
		HTML_LOG("多玩动作条", "取消法术时将拾取该法术");
		HTML_LOG("多玩动作条", "修正消耗品数量提示BUG");
		HTML_LOG("任务增强", "右击小绿点可折叠任务追踪");
		HTML_LOG("拍卖助手", "修正版本信息错误");
		HTML_LOG("任务增强", "分解为战场和竞技场模块");
		HTML_LOG("聊天助手", "恢复系统的频道记录习惯");
	HTML_END();	
elseif (GetLocale() == "zhTW") then
	HTML_BEGIN();
		HTML_TITLE("更新日誌:");
		HTML_VER("2013-03-11(5.2.0.0)");
		HTML_LOG("多玩魔盒", "升級到到5.0.2版本");

		HTML_VER("2012-09-27(5.0.0.3)");
		HTML_LOG("多玩魔盒", "升级到熊猫人版本");

		HTML_VER("2012-09-04(5.0.0.2)");
		HTML_LOG("职业守护条", "恢复职业守护条");
		HTML_LOG("多玩界面", "恢复多玩界面");

		HTML_VER("2012-09-03(5.0.0.1)");
		HTML_LOG("多玩魔盒", "修正守護條與寵物條重合的問題");
		HTML_LOG("多玩魔盒", "地城搜索器不會再被隱藏");

		HTML_VER("2012-08-31(5.0.0.0)");
		HTML_LOG("多玩魔盒", "更新到臺服熊貓人前夕版本");

		HTML_VER("2011-12-29(4.3.0.3)");
		HTML_LOG("多玩魔盒", "全面更新到國服版本");

		HTML_VER("2011-12-5(4.3.0.2)");
		HTML_LOG("戰鬥指示器", "修正戰鬥指示器錯誤");
		HTML_LOG("副本掉落", "增加新增副本掉落查詢");

		HTML_VER("2011-12-1(4.3.0.1)");
		HTML_LOG("多玩魔盒", "全面更新到4.3版本(待完善)");

		HTML_VER("2010-10-13(4.2.0.3)");
		HTML_LOG("背包整理", "專業物品將整理入專業背包");
		HTML_LOG("背包整合", "優化任務物品和特殊背包的顯示");
		HTML_LOG("商業技能", "已經學會的配方加上明顯標記");
		HTML_LOG("採集助手", "Ace庫更新到最新版本");
		HTML_LOG("首領模塊", "首領模塊更新到最新語音版");

		HTML_VER("2010-9-24(4.2.0.2)");
		HTML_LOG("多玩魔盒", "全面更新為國服兼容版本");

		HTML_VER("2010-6-30(4.2.0.1)");
		HTML_LOG("多玩魔盒", "全面升級至3.2版本");

		HTML_VER("2010-6-17(3.1.0.25)");
		HTML_LOG("毒藥守護條", "重新實現後不再卡機");

		HTML_VER("2010-5-10(3.1.0.20)");
		HTML_LOG("毒药守护条", "尝试修复卡机的问题");	
		HTML_LOG("自动购买", "加入自动购买施法材料的功能");	
		HTML_LOG("基本库", "更新Ace库版本");	

		HTML_VER("2010-5-3(3.1.0.19)");
		HTML_LOG("職業輔助", "法師擁有了傳送姿態條");	

		HTML_VER("2010-4-30(3.1.0.18)");
		HTML_LOG("職業輔助", "潛行者擁有了毒藥姿態條");	
		HTML_LOG("愛心功能", "添加很有愛心的雙采工具");
		HTML_LOG("調試資訊", "關閉團隊插件時不再報錯");
		HTML_LOG("傷害輸出", "基本傷害輸出能正常關閉了");
		HTML_LOG("仇恨統計", "修正仇恨統計的細微BUG");
		HTML_LOG("字體相關", "物品數量字體更易辨識");
		HTML_LOG("獵人助手", "餵食寵物進度條將正常顯示");

		HTML_VER("2010-4-29(3.1.0.17)");
		HTML_LOG("多玩移動", "不再會出現堆疊溢位了");	
		HTML_LOG("多玩DKP", "加入多玩原DKP插件");
		HTML_LOG("近戰進度條", "添加近戰進度條模組");
		HTML_LOG("拍賣助手", "新增防一口價防偽功能");
		HTML_LOG("雜項改動", "精簡ACE庫以減少資源佔用");

		HTML_VER("2010-4-24(3.1.0.16)");
		HTML_LOG("多玩移動", "修正已知的全部問題");	
		HTML_LOG("多玩移動", "配置介面不會跑出螢幕了");

		HTML_VER("2010-4-23(3.1.0.15)");
		HTML_LOG("多玩移動", "修正潛行結束後的BUG");	
		HTML_LOG("首領模組", "漢化部分toc資訊");

		HTML_VER("2010-4-24(3.1.0.14)");
		HTML_LOG("多玩移動", "修正切換形態時報錯");	
		HTML_LOG("多玩移動", "修正控制怪物時報錯");
		HTML_LOG("多玩移動", "感謝熾火提供的幫助");	

		HTML_VER("2010-4-23(3.1.0.13)");
		HTML_LOG("多玩移動", "修正菜單條消失BUG");	
		HTML_LOG("銀行整合", "銀行整合可以交換物品了");
		HTML_LOG("首領模組", "現在可以載入TBC模組了");
		HTML_LOG("戰鬥指示", "添加傷害輸出項(系統功能)");
		HTML_LOG("聊天增強", "增加一個聊天通道分頁");
		HTML_LOG("拾取模組", "添加自動拾取項(系統功能)");

		HTML_VER("2010-4-22(3.1.0.12)");
		HTML_LOG("多玩移動", "修正鎖定後介面移位元BUG");
		HTML_LOG("多玩移動", "縮放的時候視窗不再移動");

		HTML_VER("2010-4-22(3.1.0.11)");
		HTML_LOG("多玩移動", "介面移動現在可以使用了");
		HTML_LOG("聊天增強", "修正聊天分頁引起的BUG");
		HTML_LOG("團隊模組", "修正DBM引起的BUG");

		HTML_VER("2010-4-20(3.1.0.10)");
		HTML_LOG("多玩移動", "新增介面移動功能");
		HTML_LOG("交易增強", "修正值發送密語的錯誤");
		HTML_LOG("施法計時", "現在可以正確的顯示時間了");
		HTML_LOG("一鍵換裝", "新增一鍵換裝模組");
		HTML_LOG("首領模組", "改為更好用的DBM");
		HTML_LOG("聊天增強", "修正分頁重疊的BUG");

		HTML_VER("2010-4-15(3.1.0.9)");
		HTML_LOG("獵人助手", "守護條載入時將正確顯示");
		HTML_LOG("施法計時", "修正施法計時的nil報錯");
		HTML_LOG("背包整合", "增加拖動改變排列功能");
		HTML_LOG("模組命名", "各個模組的命名更加易懂");
		HTML_LOG("聊天增強", "增加聊天自動分頁功能");
		HTML_LOG("交易增強", "你可以選擇通報的頻道了");

		HTML_VER("2010-4-10(3.1.0.8)");
		HTML_LOG("獵人助手", "修復因本地化資訊報錯");
		HTML_LOG("插件管理", "左上角增加額外提示資訊");

		HTML_VER("2010-4-8(3.1.0.7)");
		HTML_LOG("頭像增強", "現在隊友頭像擴展可以關閉了");
		HTML_LOG("戰鬥指示器", "加入預設特效法術報警");
		HTML_LOG("特效指示器", "加入EventAlert, 缺省關閉");
		HTML_LOG("多玩動作條", "支援轉換天賦時切換技能");
		HTML_LOG("多玩動作條", "Shift+右鍵取消法術設置");
		HTML_LOG("多玩動作條", "增加按鍵綁定功能");
		HTML_LOG("人物屬性", "人物屬性面板顯示維修費用");
		HTML_LOG("延遲施法條", "加入施法剩餘時間顯示");	
		
		HTML_VER("2010-4-6(3.1.0.6)");
		HTML_LOG("團隊插件", "增加團隊插件標籤");
		HTML_LOG("團隊插件", "現在有了快捷的配置");
		HTML_LOG("仇恨統計", "跟/show說拜拜吧");
		HTML_LOG("傷害統計", "跟仇恨統計握手吧");
		HTML_LOG("團隊報警", "增加RaidAlerter利器");
		HTML_LOG("獵人助手", "增加自動射擊計時條");
		HTML_LOG("任務增強", "修正LinkButton報錯");
		HTML_LOG("圖騰助手", "圖騰條缺省可以施法了");
		HTML_LOG("DCT", "刪除傷害輸出模組");
		HTML_LOG("ACE庫", "修正屬性統計邏輯錯誤");

		HTML_VER("2010-4-4(3.1.0.4)");
		HTML_LOG("更新日誌", "點擊版本號可查看更新日誌");
		HTML_LOG("滑鼠提示", "增加副天賦資訊顯示");
		HTML_LOG("雜項改動", "在toc中加入多玩插件標誌");

		HTML_VER("2010-4-3(3.1.0.3)");
		HTML_LOG("增強地圖", "漢化地圖上按鍵資訊");
		HTML_LOG("基本庫", "動態載入插件現在將正確觸發");
		HTML_LOG("獵人模組", "增加守護動作條");
		HTML_LOG("背包整理", "按鍵提示文字改為系統風格");
		HTML_LOG("聊天助手", "聊天框文字以缺省字體顯示");
		HTML_LOG("商業技能庫", "去掉toc裏多餘的依賴標籤");
		HTML_LOG("基本庫", "團隊插件後加上相應的英文名");
		HTML_LOG("多玩動作條", "增加宏、坐騎等支援");
		HTML_LOG("多玩動作條", "取消法術時將拾取該法術");
		HTML_LOG("多玩動作條", "修正消耗品數量提示BUG");
		HTML_LOG("任務增強", "右擊小綠點可折疊任務追蹤");
		HTML_LOG("拍賣助手", "修正版本資訊錯誤");
		HTML_LOG("任務增強", "分解為戰場和競技場模組");
		HTML_LOG("聊天助手", "恢復系統的頻道記錄習慣");	
	HTML_END();	
end